package com.github.catvod.spider.merge;

import com.github.catvod.crawler.SpiderDebug;
import com.github.catvod.parser.C0000;
import com.github.catvod.parser.C0001;
import com.github.catvod.parser.C0002;
import com.github.catvod.parser.C0003;
import com.github.catvod.parser.C0005;
import com.github.catvod.parser.C0006;
import com.github.catvod.parser.C0007;
import com.github.catvod.parser.C0008;
import com.github.catvod.parser.C0010;
import com.github.catvod.parser.C0011;
import com.github.catvod.parser.C0012;
import com.github.catvod.parser.C0013;
import com.github.catvod.parser.C0015;
import com.github.catvod.spider.C0042;
import com.github.catvod.spider.C0043;
import com.github.catvod.spider.C0044;
import com.github.catvod.spider.C0045;
import com.github.catvod.spider.C0046;
import com.github.catvod.spider.C0048;
import com.github.catvod.spider.C0049;
import com.github.catvod.spider.C0050;
import com.github.catvod.spider.C0051;
import com.github.catvod.spider.C0052;
import com.github.catvod.spider.C0053;
import com.github.catvod.spider.C0055;
import com.github.catvod.spider.C0056;
import com.github.catvod.spider.C0057;
import com.github.catvod.spider.merge.V;
import com.google.gson.JsonElement;
import com.google.gson.JsonObject;
import com.google.gson.JsonParser;
import java.io.File;
import java.io.IOException;
import java.io.InputStream;
import java.nio.ByteBuffer;
import java.util.Arrays;
import java.util.Calendar;
import java.util.Date;
import java.util.Iterator;
import org.json.JSONException;
import org.json.JSONObject;
/* loaded from: E:\develop\workspace\private\Playhub\tvbox\decompiled\response\classes_inner.dex */
public final class FO implements Pu {

    /* renamed from: short  reason: not valid java name */
    private static final short[] f58short = {1898, 1843, 1895, 1918, 1909, 1870, 1912, 1909, 1843, 1835, 1843, 1829, 1829, 1829, 1829, 1843, 1853, 1843, 1895, 1918, 1909, 1870, 1919, 1904, 1916, 1908, 1843, 1835, 1843, -30981, 23691, 30784, 29129, 25731, 22942, 1843, 1853, 1843, 1895, 1918, 1909, 1870, 1889, 1912, 1906, 1843, 1835, 1843, 1913, 1893, 1893, 1889, 1890, 1835, 1854, 1854, 1912, 1916, 1910, 1825, 1830, 1855, 1890, 1918, 1910, 1918, 1892, 1906, 1909, 1919, 1855, 1906, 1918, 1916, 1854, 1895, 1827, 1854, 1893, 1913, 1892, 1916, 1907, 1854, 1891, 1908, 1893, 1896, 1889, 1908, 1870, 1908, 1897, 1906, 1917, 1892, 1909, 1908, 1870, 1910, 1912, 1911, 1854, 1908, 1897, 1893, 1854, 1904, 1892, 1893, 1918, 1854, 1888, 1854, 1832, 1828, 1854, 1906, 1891, 1918, 1889, 1854, 1897, 1896, 1854, 1904, 1912, 1854, 1893, 1854, 1825, 1854, 1838, 1904, 1889, 1889, 1912, 1909, 1836, 1824, 1827, 1827, 1847, 1892, 1891, 1917, 1836, 1913, 1893, 1893, 1889, 1890, 1835, 1854, 1854, 1890, 1824, 1855, 1912, 1916, 1904, 1910, 1908, 1913, 1892, 1907, 1855, 1906, 1906, 1854, 1912, 1916, 1904, 1910, 1908, 1890, 1854, 1827, 1825, 1827, 1829, 1854, 1824, 1824, 1854, 1825, 1831, 1854, 1826, 1826, 1831, 1904, 1827, 1828, 1825, 1824, 1908, 1827, 1826, 1829, 1828, 1906, 1908, 1909, 1824, 1828, 1909, 1827, 1906, 1909, 1911, 1833, 1824, 1906, 1909, 1831, 1908, 1911, 1833, 1904, 1855, 1915, 1889, 1910, 1843, 1853, 1843, 1895, 1918, 1909, 1870, 1891, 1908, 1916, 1904, 1891, 1914, 1890, 1843, 1835, 1841, 1843, 1843, 1853, 1843, 1904, 1906, 1893, 1912, 1918, 1919, 1843, 1835, 1843, 1889, 1904, 1919, 1858, 1918, 1891, 1893, 1858, 1913, 1918, 1894, 1843, 1900, 619, 585, 582, 582, 583, 604, 520, 602, 589, 585, 588, 520, 590, 605, 580, 580, 593, 520, 577, 582, 604, 583, 520, 586, 593, 604, 589, 520, 586, 605, 590, 590, 589, 602, 3323, 3234, 3318, 3311, 3300, 3295, 3305, 3300, 3234, 3258, 3234, 3253, 3253, 3253, 3253, 3234, 3244, 3234, 3318, 3311, 3300, 3295, 3310, 3297, 3309, 3301, 3234, 3258, 3234, 29649, 31320, 29247, -32401, 24269, 22670, 28434, 21007, 3234, 3244, 3234, 3318, 3311, 3300, 3295, 3312, 3305, 3299, 3234, 3258, 3234, 3304, 3316, 3316, 3312, 3315, 3258, 3247, 3247, 3305, 3309, 3303, 3248, 3255, 3246, 3315, 3311, 3303, 3311, 3317, 3299, 3300, 3310, 3246, 3299, 3311, 3309, 3247, 3318, 3250, 3247, 3316, 3304, 3317, 3309, 3298, 3247, 3314, 3301, 3316, 3321, 3312, 3301, 3295, 3301, 3320, 3299, 3308, 3317, 3300, 3301, 3295, 3303, 3305, 3302, 3247, 3301, 3320, 3316, 3247, 3297, 3317, 3316, 3311, 3247, 3313, 3247, 3257, 3253, 3247, 3299, 3314, 3311, 3312, 3247, 3320, 3321, 3247, 3297, 3305, 3247, 3316, 3247, 3248, 3247, 3263, 3297, 3312, 3312, 3305, 3300, 3261, 3249, 3250, 3250, 3238, 3317, 3314, 3308, 3261, 3304, 3316, 3316, 3312, 3315, 3258, 3247, 3247, 3315, 3249, 3246, 3305, 3309, 3297, 3303, 3301, 3304, 3317, 3298, 3246, 3299, 3299, 3247, 3305, 3309, 3297, 3303, 3301, 3315, 3247, 3250, 3248, 3250, 3252, 3247, 3249, 3249, 3247, 3249, 3249, 3247, 3256, 3300, 3254, 3299, 3257, 3302, 3248, 3251, 3256, 3257, 3251, 3297, 3253, 3301, 3256, 3253, 3301, 3302, 3254, 3302, 3251, 3252, 3256, 3254, 3254, 3297, 3249, 3298, 3257, 3297, 3250, 3256, 3246, 3306, 3312, 3303, 3234, 3244, 3234, 3318, 3311, 3300, 3295, 3314, 3301, 3309, 3297, 3314, 3307, 3315, 3234, 3258, 3232, 3234, 3234, 3244, 3234, 3297, 3299, 3316, 3305, 3311, 3310, 3234, 3258, 3234, 3312, 3297, 3310, 3283, 3311, 3317, 3314, 3299, 3301, 3283, 3311, 3314, 3316, 3283, 3304, 3311, 3319, 3234, 3325, 2359, 2414, 2362, 2339, 2344, 2323, 2341, 2344, 2414, 2422, 2414, 2426, 2426, 2426, 2426, 2414, 2400, 2414, 2362, 2339, 2344, 2323, 2338, 2349, 2337, 2345, 2414, 2422, 2414, 27399, 23524, 27364, -26291, 30237, 32660, 27332, 28175, 2414, 2400, 2414, 2362, 2339, 2344, 2323, 2364, 2341, 2351, 2414, 2422, 2414, 2340, 2360, 2360, 2364, 2367, 2422, 2403, 2403, 2341, 2337, 2347, 2428, 2427, 2402, 2367, 2339, 2347, 2339, 2361, 2351, 2344, 2338, 2402, 2351, 2339, 2337, 2403, 2362, 2430, 2403, 2360, 2340, 2361, 2337, 2350, 2403, 2366, 2345, 2360, 2357, 2364, 2345, 2323, 2345, 2356, 2351, 2336, 2361, 2344, 2345, 2323, 2347, 2341, 2346, 2403, 2345, 2356, 2360, 2403, 2349, 2361, 2360, 2339, 2403, 2365, 2403, 2421, 2425, 2403, 2351, 2366, 2339, 2364, 2403, 2356, 2357, 2403, 2349, 2341, 2403, 2360, 2403, 2428, 2403, 2419, 2349, 2364, 2364, 2341, 2344, 2417, 2429, 2430, 2430, 2410, 2361, 2366, 2336, 2417, 2340, 2360, 2360, 2364, 2367, 2422, 2403, 2403, 2367, 2429, 2402, 2341, 2337, 2349, 2347, 2345, 2340, 2361, 2350, 2402, 2351, 2351, 2403, 2341, 2337, 2349, 2347, 2345, 2367, 2403, 2430, 2428, 2430, 2424, 2403, 2429, 2429, 2403, 2428, 2426, 2403, 2350, 2427, 2427, 2428, 2425, 2424, 2350, 2431, 2427, 2426, 2431, 2429, 2351, 2350, 2350, 2421, 2351, 2349, 2429, 2429, 2428, 2350, 2344, 2425, 2430, 2345, 2430, 2431, 2425, 2425, 2424, 2345, 2402, 2364, 2338, 2347, 2414, 2400, 2414, 2362, 2339, 2344, 2323, 2366, 2345, 2337, 2349, 2366, 2343, 2367, 2414, 2422, 2412, 2414, 2414, 2400, 2414, 2349, 2351, 2360, 2341, 2339, 2338, 2414, 2422, 2414, 2364, 2361, 2367, 2340, 2319, 2343, 2335, 2340, 2339, 2363, 2414, 2353, 3110, 3074, 3092, 3106, 3103, 3091, 3093, 3078, 3107, 3078, 3091, 3078, 3125, 3074, 3076, 3080, 3093, 3075, 3143, 3081, 3080, 3091, 3143, 3095, 3093, 3074, 3092, 3074, 3081, 3091, 3143, 3086, 3081, 3143, 3083, 3080, 3076, 3078, 3083, 3143, 3087, 3074, 3078, 3075, 3074, 3093, 3143, 3073, 3080, 3093, 3143, 3078, 3074, 3092, 3143, 3074, 3081, 3076, 3093, 3102, 3095, 3091, 3074, 3075, 3143, 3075, 3078, 3091, 3078, 1767, 1780, 1780, 1767, 1791, 658, 715, 671, 646, 653, 694, 640, 653, 715, 723, 715, 651, 653, 653, 653, 715, 709, 715, 671, 646, 653, 694, 647, 648, 644, 652, 715, 723, 715, 27884, -27507, 29847, 23631, 682, 646, 646, 642, 640, 652, 715, 709, 715, 671, 646, 653, 694, 665, 640, 650, 715, 723, 715, 641, 669, 669, 665, 666, 723, 710, 710, 640, 644, 654, 729, 734, 711, 666, 646, 654, 646, 668, 650, 653, 647, 711, 650, 646, 644, 710, 671, 731, 710,
        669, 641, 668, 644, 651, 710, 667, 652, 669, 656, 665, 652, 694, 652, 657, 650, 645, 668, 653, 652, 694, 654, 640, 655, 710, 652, 657, 669, 710, 648, 668, 669, 646, 710, 664, 710, 720, 732, 710, 650, 667, 646, 665, 710, 657, 656, 710, 648, 640, 710, 669, 710, 729, 710, 726, 648, 665, 665, 640, 653, 724, 728, 731, 731, 719, 668, 667, 645, 724, 641, 669, 669, 665, 666, 723, 710, 710, 666, 728, 711, 640, 644, 648, 654, 652, 641, 668, 651, 711, 650, 650, 710, 640, 644, 648, 654, 652, 666, 710, 731, 729, 731, 735, 710, 729, 733, 710, 729, 734, 710, 648, 721, 733, 731, 653, 720, 729, 729, 729, 730, 721, 733, 648, 650, 729, 651, 651, 655, 733, 732, 655, 732, 732, 653, 652, 651, 730, 733, 733, 648, 720, 652, 711, 643, 665, 654, 715, 709, 715, 671, 646, 653, 694, 667, 652, 644, 648, 667, 642, 666, 715, 723, 713, 715, 715, 709, 715, 648, 650, 669, 640, 646, 647, 715, 723, 715, 683, 653, 682, 645, 652, 648, 647, 715, 660, 1217, 1176, 1228, 1237, 1246, 1253, 1235, 1246, 1176, 1152, 1176, 1163, 1163, 1163, 1163, 1176, 1174, 1176, 1228, 1237, 1246, 1253, 1236, 1243, 1239, 1247, 1176, 1152, 1176, 27327, -27938, -28027, 30274, 1230, 1237, 1233, 1247, 1236, 1176, 1174, 1176, 1228, 1237, 1246, 1253, 1226, 1235, 1241, 1176, 1152, 1176, 1234, 1230, 1230, 1226, 1225, 1152, 1173, 1173, 1235, 1239, 1245, 1162, 1165, 1172, 1225, 1237, 1245, 1237, 1231, 1241, 1246, 1236, 1172, 1241, 1237, 1239, 1173, 1228, 1160, 1173, 1230, 1234, 1231, 1239, 1240, 1173, 1224, 1247, 1230, 1219, 1226, 1247, 1253, 1247, 1218, 1241, 1238, 1231, 1246, 1247, 1253, 1245, 1235, 1244, 1173, 1247, 1218, 1230, 1173, 1243, 1231, 1230, 1237, 1173, 1227, 1173, 1155, 1167, 1173, 1241, 1224, 1237, 1226, 1173, 1218, 1219, 1173, 1243, 1235, 1173, 1230, 1173, 1162, 1173, 1157, 1243, 1226, 1226, 1235, 1246, 1159, 1163, 1160, 1160, 1180, 1231, 1224, 1238, 1159, 1234, 1230, 1230, 1226, 1225, 1152, 1173, 1173, 1225, 1163, 1172, 1235, 1239, 1243, 1245, 1247, 1234, 1231, 1240, 1172, 1241, 1241, 1173, 1235, 1239, 1243, 1245, 1247, 1225, 1173, 1160, 1162, 1160, 1166, 1173, 1163, 1163, 1173, 1162, 1164, 1173, 1161, 1163, 1246, 1154, 1244, 1244, 1162, 1165, 1161, 1247, 1166, 1166, 1246, 1164, 1164, 1155, 1161, 1244, 1240, 1240, 1241, 1244, 1240, 1247, 1164, 1155, 1246, 1162, 1243, 1165, 1162, 1161, 1172, 1232, 1226, 1245, 1176, 1174, 1176, 1228, 1237, 1246, 1253, 1224, 1247, 1239, 1243, 1224, 1233, 1225, 1176, 1152, 1178, 1176, 1176, 1174, 1176, 1243, 1241, 1230, 1235, 1237, 1236, 1176, 1152, 1176, 1243, 1238, 1235, 1273, 1238, 1247, 1243, 1236, 1176, 1223, 277, 280, 285, 3055, 3051, 3071, 3052, 3061, 2137, 2127, 1732, 1762, 1413, 1500, 1416, 1425, 1434, 1441, 1431, 1434, 1500, 1476, 1500, 1484, 1484, 1484, 1484, 1500, 1490, 1500, 1416, 1425, 1434, 1441, 1424, 1439, 1427, 1435, 1500, 1476, 1500, 27643, -27750, 23750, 30664, 1469, 1425, 1425, 1429, 1431, 1435, 1500, 1490, 1500, 1416, 1425, 1434, 1441, 1422, 1431, 1437, 1500, 1476, 1500, 1430, 1418, 1418, 1422, 1421, 1476, 1489, 1489, 1431, 1427, 1433, 1486, 1481, 1488, 1421, 1425, 1433, 1425, 1419, 1437, 1434, 1424, 1488, 1437, 1425, 1427, 1489, 1416, 1484, 1489, 1418, 1430, 1419, 1427, 1436, 1489, 1420, 1435, 1418, 1415, 1422, 1435, 1441, 1435, 1414, 1437, 1426, 1419, 1434, 1435, 1441, 1433, 1431, 1432, 1489, 1435, 1414, 1418, 1489, 1439, 1419, 1418, 1425, 1489, 1423, 1489, 1479, 1483, 1489, 1437, 1420, 1425, 1422, 1489, 1414, 1415, 1489, 1439, 1431, 1489, 1418, 1489, 1486, 1489, 1473, 1439, 1422, 1422, 1431, 1434, 1475, 1487, 1484, 1484, 1496, 1419, 1420, 1426, 1475, 1430, 1418, 1418, 1422, 1421, 1476, 1489, 1489, 1421, 1487, 1488, 1431, 1427, 1439, 1433, 1435, 1430, 1419, 1436, 1488, 1437, 1437, 1489, 1431, 1427, 1439, 1433, 1435, 1421, 1489, 1484, 1486, 1484, 1482, 1489, 1487, 1487, 1489, 1486, 1480, 1489, 1434, 1432, 1485, 1432, 1436, 1482, 1434, 1481, 1486, 1486, 1479, 1485, 1478, 1485, 1434, 1485, 1439, 1479, 1483, 1437, 1435, 1432, 1480, 1480, 1479, 1478, 1437, 1478, 1479, 1484, 1486, 1486, 1488, 1428, 1422, 1433, 1500, 1490, 1500, 1416, 1425, 1434, 1441, 1420, 1435, 1427, 1439, 1420, 1429, 1421, 1500, 1476, 1502, 1500, 1500, 1490, 1500, 1439, 1437, 1418, 1431, 1425, 1424, 1500, 1476, 1500, 1423, 1419, 1439, 1420, 1429, 1469, 1426, 1435, 1439, 1424, 1500, 1411, 454, 452, 1898, 1843, 1895, 1918, 1909, 1870, 1912, 1909, 1843, 1835, 1843, 1826, 1826, 1826, 1826, 1843, 1853, 1843, 1895, 1918, 1909, 1870, 1919, 1904, 1916, 1908, 1843, 1835, 1843, 26900, -28299, 18441, 27457, 1874, 1918, 1918, 1914, 1912, 1908, 1843, 1853, 1843, 1895, 1918, 1909, 1870, 1889, 1912, 1906, 1843, 1835, 1843, 1913, 1893, 1893, 1889, 1890, 1835, 1854, 1854, 1912, 1916, 1910, 1825, 1830, 1855, 1890, 1918, 1910, 1918, 1892, 1906, 1909, 1919, 1855, 1906, 1918, 1916, 1854, 1895, 1827, 1854, 1893, 1913, 1892, 1916, 1907, 1854, 1891, 1908, 1893, 1896, 1889, 1908, 1870, 1908, 1897, 1906, 1917, 1892, 1909, 1908, 1870, 1910, 1912, 1911, 1854, 1908, 1897, 1893, 1854, 1904, 1892, 1893, 1918, 1854, 1888, 1854, 1832, 1828, 1854, 1906, 1891, 1918, 1889, 1854, 1897, 1896, 1854, 1904, 1912, 1854, 1893, 1854, 1825, 1854, 1838, 1904, 1889, 1889, 1912, 1909, 1836, 1824, 1827, 1827, 1847, 1892, 1891, 1917, 1836, 1913, 1893, 1893, 1889, 1890, 1835, 1854, 1854, 1890, 1824, 1855, 1912, 1916, 1904, 1910, 1908, 1913, 1892, 1907, 1855, 1906, 1906, 1854, 1912, 1916, 1904, 1910, 1908, 1890, 1854, 1827, 1825, 1827, 1829, 1854, 1824, 1824, 1854, 1825, 1830, 1854, 1828, 1909, 1826, 1909, 1829, 1826, 1908, 1828, 1831, 1825, 1825, 1833, 1829, 1829, 1828, 1831, 1907, 1824, 1908, 1907, 1906, 1828, 1904, 1911, 1833, 1904, 1826, 1827, 1911, 1911, 1907, 1831, 1855, 1889, 1919, 1910, 1843, 1853, 1843, 1895, 1918, 1909, 1870, 1891, 1908, 1916, 1904, 1891, 1914, 1890, 1843, 1835, 1841, 1843, 1843, 1853, 1843, 1904, 1906, 1893, 1912, 1918, 1919, 1843, 1835, 1843, 1892, 1906, 1874, 1917, 1908, 1904,
        1919, 1843, 1900, 1996, 1991, 1986, 1984, 1995, 1935, 1944, 1944, 1944, 1935, 2975, 2980, 2985, 2976, 2976, 3052, 2991, 2979, 2977, 2977, 2989, 2978, 2984, 3052, 2986, 2989, 2981, 2976, 2985, 2984, 3052, 3003, 2981, 3000, 2980, 3052, 2985, 2996, 2981, 3000, 3052, 2991, 2979, 2984, 2985, 3052, 2316, 2389, 2305, 2328, 2323, 2344, 2334, 2323, 2389, 2381, 2389, 2375, 2375, 2375, 2375, 2389, 2395, 2389, 2305, 2328, 2323, 2344, 2329, 2326, 2330, 2322, 2389, 2381, 2389, 32524, 22546, -30563, 21638, 30246, 32687, 2389, 2395, 2389, 2305, 2328, 2323, 2344, 2311, 2334, 2324, 2389, 2381, 2389, 2335, 2307, 2307, 2311, 2308, 2381, 2392, 2392, 2334, 2330, 2320, 2375, 2368, 2393, 2308, 2328, 2320, 2328, 2306, 2324, 2323, 2329, 2393, 2324, 2328, 2330, 2392, 2305, 2373, 2392, 2307, 2335, 2306, 2330, 2325, 2392, 2309, 2322, 2307, 2318, 2311, 2322, 2344, 2322, 2319, 2324, 2331, 2306, 2323, 2322, 2344, 2320, 2334, 2321, 2392, 2322, 2319, 2307, 2392, 2326, 2306, 2307, 2328, 2392, 2310, 2392, 2382, 2370, 2392, 2324, 2309, 2328, 2311, 2392, 2319, 2318, 2392, 2326, 2334, 2392, 2307, 2392, 2375, 2392, 2376, 2326, 2311, 2311, 2334, 2323, 2378, 2374, 2373, 2373, 2385, 2306, 2309, 2331, 2378, 2335, 2307, 2307, 2311, 2308, 2381, 2392, 2392, 2308, 2374, 2393, 2334, 2330, 2326, 2320, 2322, 2335, 2306, 2325, 2393, 2324, 2324, 2392, 2334, 2330, 2326, 2320, 2322, 2308, 2392, 2373, 2375, 2373, 2369, 2392, 2375, 2372, 2392, 2375, 2374, 2392, 2374, 2374, 2368, 2322, 2370, 2371, 2323, 2368, 2321, 2372, 2325, 2326, 2382, 2374, 2325, 2382, 2368, 2372, 2326, 2325, 2374, 2373, 2368, 2371, 2368, 2371, 2383, 2324, 2373, 2321, 2370, 2368, 2393, 2330, 2323, 2393, 2333, 2311, 2320, 2389, 2395, 2389, 2305, 2328, 2323, 2344, 2309, 2322, 2330, 2326, 2309, 2332, 2308, 2389, 2381, 2391, 2389, 2389, 2395, 2389, 2326, 2324, 2307, 2334, 2328, 2329, 2389, 2381, 2389, 2363, 2328, 2320, 2334, 2329, 2340, 2335, 2328, 2304, 2389, 2314, 2402, 2363, 2415, 2422, 2429, 2374, 2416, 2429, 2363, 2339, 2363, 2350, 2350, 2350, 2350, 2363, 2357, 2363, 2415, 2422, 2429, 2374, 2423, 2424, 2420, 2428, 2363, 2339, 2363, 24013, 24048, -31681, 23278, 32610, 22092, 2353, -27711, 31778, -31695, 2352, 2363, 2357, 2363, 2415, 2422, 2429, 2374, 2409, 2416, 2426, 2363, 2339, 2363, 2417, 2413, 2413, 2409, 2410, 2339, 2358, 2358, 2416, 2420, 2430, 2345, 2350, 2359, 2410, 2422, 2430, 2422, 2412, 2426, 2429, 2423, 2359, 2426, 2422, 2420, 2358, 2415, 2347, 2358, 2413, 2417, 2412, 2420, 2427, 2358, 2411, 2428, 2413, 2400, 2409, 2428, 2374, 2428, 2401, 2426, 2421, 2412, 2429, 2428, 2374, 2430, 2416, 2431, 2358, 2428, 2401, 2413, 2358, 2424, 2412, 2413, 2422, 2358, 2408, 2358, 2336, 2348, 2358, 2426, 2411, 2422, 2409, 2358, 2401, 2400, 2358, 2424, 2416, 2358, 2413, 2358, 2345, 2358, 2342, 2424, 2409, 2409, 2416, 2429, 2340, 2344, 2347, 2347, 2367, 2412, 2411, 2421, 2340, 2417, 2413, 2413, 2409, 2410, 2339, 2358, 2358, 2410, 2344, 2359, 2416, 2420, 2424, 2430, 2428, 2417, 2412, 2427, 2359, 2426, 2426, 2358, 2416, 2420, 2424, 2430, 2428, 2410, 2358, 2347, 2345, 2347, 2349, 2358, 2344, 2344, 2358, 2345, 2350, 2358, 2336, 2428, 2346, 2349, 2345, 2350, 2344, 2349, 2431, 2351, 2345, 2345, 2345, 2350, 2346, 2428, 2350, 2427, 2427, 2348, 2346, 2336, 2350, 2424, 2337, 2336, 2426, 2351, 2429, 2349, 2347, 2346, 2359, 2419, 2409, 2430, 2363, 2357, 2363, 2415, 2422, 2429, 2374, 2411, 2428, 2420, 2424, 2411, 2418, 2410, 2363, 2339, 2361, 2363, 2363, 2357, 2363, 2424, 2426, 2413, 2416, 2422, 2423, 2363, 2339, 2363, 2427, 2416, 2421, 2416, 2363, 2404, 3003, 2962, 2969, 2960, 2947, 2975, 3031, 2960, 2949, 2962, 2966, 2947, 2962, 2949, 3031, 2947, 2975, 2966, 2969, 3031, 2965, 2946, 2961, 2961, 2962, 2949, 3031, 2948, 2974, 2957, 2962, 2994, 2969, 2971, 2973, 2952, 2965, 2954, 2969, 3036, 2960, 2969, 2962, 2971, 2952, 2964, 2624, 2667, 2665, 2671, 2682, 2663, 2680, 2667, 2606, 2657, 2664, 2664, 2685, 2667, 2682};
    private static JSONObject yq;

    public /* synthetic */ FO() {
        int i = C0037.m1870();

        if (i > 0) {
            return;
        } else {
            System.out.println(Double.decode(C0005.m161("q1")));
            return;
        }
    }

    public static JSONObject B() {
        int i;
        try {
            yq = new JSONObject(C0053.m2276(m1035(), 0, 267, 1809));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static int F5(InputStream inputStream, byte[] bArr) {
        int i = C0049.m2182(inputStream, bArr);
        int length = bArr.length;

        if (!(i == length)) {
            int length2 = bArr.length - i;
            int i3 = 0;
            int i4 = 1;
            while (true) {
                int length3 = bArr.length;
                if (i < length3) {
                    if (i3 != -1) {
                        if (i4 < 15) {
                            i3 = C0026.m1568(inputStream, bArr, i, length2);
                            if (i3 > 0) {
                                i += i3;
                                length2 -= i3;
                            }
                            i4++;
                        }
                    }
                }
            }
            int length4 = bArr.length;
            if (i != length4) {
                throw new IOException(C0000.m18(m1035(), 267, 34, 552));
            } else {
                throw new IOException(C0000.m18(m1035(), 267, 34, 552));
            }
        }
        return i;
    }

    public static JSONObject G() {
        int i;
        try {
            yq = new JSONObject(C0010.m296(m1035(), 301, 275, 3200));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static JSONObject G4() {
        int i;
        try {
            yq = new JSONObject(C0057.m2384(m1035(), 576, 268, 2380));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static int Gc(AbstractC0124j jVar) {
        int i = C0038.m1907(jVar);

        if (i == 3) {
            N n = C0013.m387(jVar);
            if (n == null) {
                throw new RuntimeException(C0044.m2052(m1035(), 844, 69, 3175));
            } else {
                return C0027.m1597(C0013.m387(jVar));
            }
        } else {
            return C0038.m1907(jVar);
        }
    }

    public static final Iterator KJ(Object[] objArr) {
        String str = "ۣۨۢ";
        short[] sArr = null;
        String str2 = null;
        C0122ih ihVar = null;
        while (true) {
            switch (C0002.m76(str)) {
                case 56572:
                ihVar = new C0122ih(objArr);
                str = "ۤۤۥ";
                break;
                case 1751557:
                C0048.m2138(objArr, str2);
                str = "ۨۤ";
                break;
                case 1751653:
                return ihVar;
                case 1755623:
                str2 = C0006.m180(sArr, 913, 5, 1670);
                str = "ۤۡۢ";
                break;
                default:
                sArr = m1035();
                str = "ۨۨۧ";
                break;
            }
        }
    }

    public static boolean M(String str) {
        for (String str2 : Arrays.asList(C0051.m2242(), "巨乳", "性瘾", "人妻", "中出", "露出", "痴汉", "裸体", "幼女", "色情", "口爆", "淫荡", "潮吹", "爱的奴隶", "荡妇", "灯草和尚", "金瓶", "终极监狱", "伊波拉病毒", "艳谭", "与鸭共舞", "青楼", "小蜜桃", "雏妓", "零性", "不道德的礼物", "甜性涩爱", "夜晚游玩生活", "妈妈的", "巨臀", "诱惑你", "授课到天亮", "秋日天空", "情色", "性爱", "淫乱", "情欲", "性事", "3D豪情", "潘金莲", "强奸", "女秘书", "阿尔玛", "美景之屋", "红辣椒", "爱人", "男与女", "囡囡", "谵妄", "赤裸的无名指", "卷毛直播妹", "波索杜斯", "灼热之舌", "塞西莉亚", "旁观者2", "爱情誓言", "寸止居酒屋", "新武则天外传", "他的滋味", "木工厂的那些事", "打底裤狂热", "她美丽", "我的好姐姐们", "相识", "大男人家政工", "日本夜伽话：扑倒太郎", "Oh！透明人间 真人版", "妹子出租中", "女人至上", "爱恨龙卷风：撕裂的欲望", "喋血劫花", "欲望号快车", "欢愉", "善良的嫂子", "娇妻肉宴：不伦痴态", "揉情港都：熟女想爱爱", "被驯服的女人", "软禁：深浅行动", "野花", "裙子里面是野兽", "后门的禁忌", "性福汤屋", "光之裸少女", "不伦妻与小恶魔女", "性欲女神：高潮迭起", "可疑的继母", "2对1商务出差按摩", "代孕", "双面人格", "美味的女大学生", "哀情口令", "少女的性技巧", "女子大生", "密爱：老板的年轻妻子", "要命高潮：双腿间的秘密", "烦人的欲望出租屋", "刻在我床底的名字", "罪恶纵横", "姐妹互换", "邪恶入侵", "快感生体実験", "两个淘气的姐妹", "脱衣舞俱乐部大屠杀", "女仆的诱惑", "爱的小历史：谁都不是恋人们的风景", "缉毒之女", "极乐租屋：房客好色", "情夜", "爱液联盟之神力女操人", "魔乳秘剑帖", "白衣天使：美臀不设防", "高潮吧！性鬼人间", "陷阱：第三者", "隐私欲望", "神奇女人", "大叔让我爱", "爱欲情话：激情小夜曲", "女仆机器人", "新进女职员：出差", "被捉奸的妻子朋友", "聊天软件：姐姐的口味", "性林医院", "她的诱人秘密", "玩火险恶局", "三分之二年", "陪酒男", "小三人生：只要和你在一起", "美魔女的诱惑", "冷酷之女：吟声阵阵", "骑骑上司妻", "吃精", "处女作家的初体验", "浪女47：桃色忠臣藏", "三民窒", "没有名字的女人们", "女孩我最大", "情事", "迷欲天使", "大人同级生红子的初恋", "淫种", "处女降", "有求必应呼叫中心", "争艳女王", "女孩上陆", "不能向上的电影", "处女掌门人", "弓道少女妄想中", "忍者女龟", "违抗者", "模特的欲望", "羊魔杀", "碧翠丝", "善良的姐妹", "江户川乱步猎奇馆 屋脊里的散步者", "方子传", "交换温柔", "冰冷热带鱼", "不良侦探", "贝拉卢娜", "失乐园1997", "惩罚1973", "理查德·奥的历史", "科奥特", "帕利坦", "热爱2014", "双人床1983", "漂亮的保姆", "土星保龄球", "艳降勾魂", "敏感姬", "金内裤姑娘", "墨东绮谭", "孽欲畸恋", "玛露和她的情人", "荒淫史", "思春期诱惑", "教科书没教的事", "百合的雨声", "妒忌2023", "寂寞男孩", "欲奴", "儿子的女友父亲的女友", "只爱你一个", "10天的爱人", "活死人公寓", "隔壁女孩", "变更旅程", "春之森林", "一千个性福夜", "妈妈，这只是一个游戏", "土耳其狂欢", "秘密2022", "比翼双飞的爱情故事", "夜莺2023", "女老板妓女", "寄生春", "借钱2020", "联合惩治", "前任五选一", "野战惊魂", "脱衣舞娘大战狼人", "峡谷2013", "挑战赛游戏", "轻蔑2011", "法利赛人", "青春H2之狂野之花", "夫妻成长日记", "玩火的女孩", "你爱的时候和被爱的时候", "继父与母女", "早恋2013", "肚脐与膝盖之间", "里约性喜剧", "像这样的夏天", "玩具2022", "偷窥闺房", "多布拉多", "前卫的众神", "愈快乐愈堕落", "提线木偶", "美味的姨母", "女杀油地狱", "馬·女·犬", "妻子保卫战", "风在吹2021", "我们X她", "循环2022", "美味的爱情和精灵", "监视2023", "水管工", "特邀送货员", "朋友的妻子", "灭门惨案", "AV偶像", "99个月亮", "女性有更高的性欲吗？", "正午之星", "露露情史", "漂亮的妹妹", "好女孩2015", "出轨的女人", "陈列室", "不溶性侵犯", "偷听的女人", "接吻忍耐锦标赛", "床2012", "S与M", "花与蛇", "落鸟", "你的妈妈是婊子！", "韵事：夫妻拼车", "美容室：特别服务", "双面阿德拉", "新・SとM 劇場版", "拷问贵妇人", "爆房有情人", "悬赏之惑", "女阴", "色欲情仇", "暴走卡车少女奈美", "女郎漫游仙境", "絶対綺麗 TONARI NO お姉さん LOVEMOTION", "我的淘气女友", "爸爸的朋友", "记忆的静物", "女大学生的沙龙室", "搜寻伊娃", "偷情的", "卡米拉今晚出柜", "奸杀犯", "干柴烈火2000", "兽性新人类", "毒燎虐焰", "德古拉：恶狱", "爱丽丝旅馆", "女高校生伪日记", "寄性兽医・铃音之进化", "未来世纪之亚马逊女战士", "最后一次", "十三门徒", "娘王", "射局", "93女爱男欢", "寄性兽医・铃音", "性灵猎人AKEBI", "迷恋2015", "华魂 幻影", "困惑的浪漫", "野店", "蜈蚣咒", "精牌特务：少女突击队", "魔鬼天使1987", "通奸", "狂野三千响", "欲望之岛", "失去自我的女人", "社宅妻暴行", "弱杀1994", "魔鬼天使1995", "灰姑娘成人版", "魅魔猎人", "性交易", "贝多芬小姐的启蒙", "性女暴力日记", "私人岛屿", "残存", "性之剧毒", "强我", "女猫1983", "不忠2002", "修女也丰狂", "性执事 唯我宠爱", "孤独的吸血少女", "蒲塔河", "臀击之爱", "西迪奥魔鬼帮", "女教师日记", "泡沫2022", "玩火2022", "超越天堂", "慾火狂蜜", "人食人实录", "赤裸惊情", "纸盒藏尸之公审", "十年爱2008", "亲密2001", "花街狂奔", "少女情怀总是诗", "情妇1975", "火腿，火腿", "睡美人2017", "桃色机密", "与我同眠2005", "不扣纽的女孩", "华丽的外出2013", "年轻母亲", "莫比乌斯", "上流社会2018", "湿地2013", "危情瘾难耐", "拥抱黑暗", "耐莉", "拳拳到肉2016", "花芯", "索多玛120天", "人鱼传说1984", "我们2017日本版", "爱恋依存症", "驯鹿游戏", "哥1972", "七夜怪谈：少女的怨念", "情陷夜巴黎", "水手服 百合族", "我的嫂子是我的女人", "她来自胡志明市", "水手服 百合族", "欲焰狂情", "朋友的爸爸", "樱姬2013", "爱情玩偶2011", "私家侦探：平冈公主和愚温达", "爱奴", "绿色椅子·爱的定义", "绿色椅子", "内衣男", "青春期的妹妹", "18伦", "最近，妹妹的样子有点怪", "蜜桃成熟时", "女集中营", "善良妈妈：贪图父亲的女人", "岳母的简介", "春色漾荡", "幻想2014", "魔力麦克2", "像拍电影一样做爱", "淫狼心", "爱爱对减肥的影响", "美味的你合格了", "成人学院", "跟别人睡了", "受难记1982", "淫欲模特", "后宫露营！", "欲望的果实", "情人：妻子的外遇", "快乐到死", "人间中毒", "于宇同：无主之花", "红字", "霜花店", "娜塔莉2010", "黄真伊", "下女2010", "背着丈夫", "周末同床", "黑天使2002", "保险女王：她的商业秘密", "早春1970", "爱人2005", "爱你九周半", "大胸", "挑逗性游戏", "性版17：男性的17种性幻想", "漂流欲室", "可疑的美容院", "温柔地杀我", "年轻母亲：我年纪如何", "家教高级课程", "19禁：别人的目的", "妓女的荣耀", "隔壁的女孩2017", "色欲迷墙", "外出2015", "夜关门：欲望之花", "情爱游戏", "美味的工作女孩", "小姐2016", "与女神同行", "丑闻2003", "寡糖电影", "名妓", "爱恋2015", "大开眼戒1999", "善良的妻子", "自由夫人2017", "新无主之花", "姨母的诱惑", "屌丝骑士", "路边摊", "想要的一天", "朋友妈妈", "被舍弃的人们", "诱人的飞行", "姐姐的朋友", "嫂子的职业", "愈合伴侣", "美丽的妈妈", "密爱2014", "朋友的妈妈", "深情触摸", "堕落东京", "外遇的妻子", "课后记忆", "地方妈妈好吃精", "姐妹性交换", "弟弟的女友", "和表姐同居", "家庭教师2019", "盛放：一对换交情侣的故事", "催眠舞蹈团", "全裸监禁", "犯罪娇妻", "颐和园", "欲女大翻身", "网红生死战", "幽灵恋上我", "我妻子的101次婚姻", "继母继妹", "我朋友的爱人", "朋友妈妈：无法忍受的日子", "小姨子", "我的性老师", "公司交换", "无限春光", "和女演员同居", "洗脑：色欲杀机", "妈妈朋友的女儿", "强入", "不道德的繁荣", "粉红色的火烈鸟1972", "我老公的朋友", "年轻嫂子", "野兽1975", "性賊セックスジャック", "美容室：特殊服务", "妻子的校友", "新婚旅行：不伦", "公公与两个儿媳", "我的朋友，他的老婆", "我叔叔的女人", "不法奸禁：四重奏", "舢舨92之爱的出航", "舞室培欲", "受难2013", "母亲的恋人", "不法奸禁：三人刑", "玛利亚的乳房", "恋上小鲜肉", "简单的爱", "唯一的妹妹", "再会：禁止成年人的爱", "表妹2017", "摇荡的心", "冷血人狼1994", "两个人的夜", "残酷角度的罗曼史", "交换工作：漂亮的女性员工", "野性2018", "继母的性教育", "夏日时光2001", "交换：你兄弟", "坏社长", "SP女探员 美之祭品", "雪地狂欢", "爱伴侣", "不要碰我", "谁和她睡觉了", "终极猎杀1994", "一切从乱步开始——日本推理之父逝后50年", "拥有两张脸的女人们", "聊斋连锁", "偷窥1993", "布拉芙夫人", "露露会说话的屁眼", "圣兽警察", "红·粉2014", "法拉维亚修女受难记", "上海丽人", "心锁1986", "団鬼六白兽的槛", "雨夜的诱惑", "禁春1993", "我的南宫大人", "十一天十一夜", "蜜桃臀工地嫂", "波霸总动员", "有罪2017", "超市夜未眠", "情难自制1993", "男人女人情人", "极道之妻", "情难自禁2007", "半妖乳娘", "中港丽人", "魔性之诱惑", "地方妈妈俱乐部", "世外情缘1993", "鬼夜叉", "学徒报告", "鸭之一族", "情劫1993", "杀奸O娘", "少女日记1999", "不文女学堂", "爱妻日记之蹂躏", "3分钟合作伙伴", "残酷女高生性私刑", "高跟鞋杀姬", "过错2003", "拜访者Q", "挥金1972", "极欲燃烧", "窥情公寓", "粉红的窗帘", "换爱大冒险", "秘恋之夏", "绘画还是做爱", "不是天使！", "情人别为我哭泣", "绝种贱男之小男人小周记", "乳房与月亮", "箱女2016", "激情社区", "年轻的母亲", "日历女孩", "我老婆的朋友", "同床春梦", "爱是坟墓", "极乐女忍者", "剧场版 尸囚狱 后篇", "变性记", "芭比·珍妮", "不伦纯爱", "团鬼六之女学生", "都是裸照惹的祸", "厕所和女人", "热情的邻居", "我朋友的妈妈", "性工作者十日谈", "女医肉奴隶", "爱之病", "性气功之探秘", "贴身情人贴身恋", "拈花惹草1976", "香港大夜总会", "妹妹太爱我了怎么办", "幸福泌尿科", "陪睡女人", "处女的关系", "定之爱", "相逢2014", "女生宿舍2017", "来了！天使们：都市篇", "精牌女医Zero", "海岛惊艳", "年轻少妇同学会", "桃花期2011", "少女奴隶牧场", "惊天桃色劫", "香帅传奇之胡铁花与小淫猴", "吸我一个吻", "被扭曲的同居生活", "恋上美人鱼2011", "聊斋艳奇之陆判性经", "伪善者2015", "虾碌情圣", "同居的目的", "娃娃脸1977", "贪婪：欲望之岛", "祖儿在香港", "祖儿在非洲", "紧缚：月之章", "宅女与执事机器人", "祖儿在莫斯科", "27个遗失的吻", "性戯王 48の奇跡", "我爱你，善良的主妇", "俱乐部的目的", "把教授玩坏了", "没穿内裤的领队", "警花与流莺", "色欲世界：奸魔者", "新任女教师：喜欢还是爱", "身心投入", "团鬼六：美女绳地狱", "敦煌夜谭", "两个女人2010", "密谈2007", "妹之恋", "爱的健身房", "妹之夏", "黑色午夜", "陪浴美人：艳子的温柔乡 温泉宿一発二日 艶子の湯", "斩魔剑 宿命之少女剑士", "姐妹狂艳", "致命诱惑 淫妻(みだらづま)~亜希子~", "奴隶市", "靓汤", "陪浴美人：高潮迭起 温泉宿一発二日 艶子の湯", "肮脏的放学后", "女地狱：濡湿的森林", "飞虎出征", "红楼春梦", "不羁的心", "好色女刑警1之麻辣师姐", "猛鬼咒", "现代豪放女", "天地无伦", "六人行不行", "迷情纽约", "妹妹的诱惑", "恋爱公寓", "外宿：朋友的女人", "AI智能恋情", "爱是棉被的香气", "昔日情人", "人头肉骨茶面", "我邻居的老婆", "新闻女郎之恋上快感", "同居关系", "脱衣舞娘", "红楼梦2018", "情不自禁1991", "切漫画", "性喜剧", "盲兽1969", "血恋", "四颗野性的心", "脱衣麻将病栋X", "犹大2004", "我要得太多，你给得太少", "过激派歌剧", "脱衣麻将：监狱篇", "脱衣麻将", "顶楼的大象", "顶楼大象", "老公原谅我", "米娅2017", "丈夫不在的午后时光", "桃木屋日记", "贪婪2016", "午后盛开的秘蜜花蕾", "天边一朵云2005", "桃色诊疗室", "做我的奴隶·第3章：由你决定", "枪2020", "罗曼史1999", "三个不道德的女人", "欲望酒店2011", "少女2001", "疯狂的果实1956", "叹息的天使 护士之泪", "欲望弹珠机", "幻影2000", "寄宿公寓", "萨德侯爵1976", "游2013", "诱人的魔鬼", "我们独自一人", "年轻妻子的工作", "在柔软的挂钩上", "有夫之妇", "脐2013", "乔纳森·阿加西拯救我的生命", "12金鸭", "尸油3D", "星探2015", "妻子的情人", "两位母亲", "姐姐的S丑闻", "禁室培欲", "真爱的伪术", "烂滚夫斗烂滚妻", "姐妹的诱惑", "凶线1981", "天蝎座之夜", "替天行道之杀兄", "索多玛的罪恶", "丧尸的屁股", "一个女人的身份证明", "Mayumi", "激战柏林", "黑月亮1975", "她唇之下", "偷月情", "映像1975", "爱很烂", "我的P.S.搭档", "樱桃2012", "坎特伯雷故事集", "贪婪四重奏", "魅惑2015", "做我的奴隶", "三女性", "女大学生的红色日记", "柴胡", "六个瑞典女孩在阿尔卑斯山", "占有欲强的女人", "樱花劫", "叛客与雷鬼", "新星星月亮太阳", "荆棘2014", "黑衣人再现", "爱欲灵媒师", "15天就玩完", "欢愉之书", "珍品2019", "365天：明日之欲", "非分熟女", "自由2019", "老千的目的", "监禁时间", "干燥的风", "365天：今时之欲", "忠贞2019", "尸囚狱", "爱的色放", "反常2016", "聊斋荷花三娘子", "聊斋画皮", "聊斋艳奇之月宫宝盒", "聊斋婴宁", "玉女聊斋", "处女心经", "黑帮大佬和我的365日", "癫马女郎之一夜情", "千金肉奴隶", "团鬼六：美教师地狱责罚", "团鬼六：修道女绳地狱", "团鬼六 女美容师绳饲育", "团鬼六 绳妆馆", "爱神2004", "皇帝也风流", "靓妹系列之不羁十七岁", "一乐也", "拉芙蕾丝", "万1983", "魔性的香", "大奥十八景", "色降", "监禁", "发光的现代史", "为人民服务", "摇摆艳夏", "朋友妈妈：成为我女人的那天", "表姐们", "秘密性史：小叔母", "我的性感蠢女儿", "姐姐朋友：离婚的第二天", "艳情轮舞", "监幽", "我的妈妈是前女友", "我朋友的丈夫", "心在跳", "朋友妈妈：朋友不在家的日子", "魔睡", "阿爸的不伦情人", "诚实：好女孩", "有特点的电影", "契约结婚", "悲伤天使", "日常关系", "渴爱女人", "让我听听你的声音", "焦燥", "VAMP", "爱情蛙跳跳", "我的妻子的姐姐", "再见了家庭教师", "妻子的秘蜜", "南洋十大邪术", "二奶村之杀夫", "裸爱情人", "祝爱好运", "四大名妓", "男爵夫人的调教", "打蛇1980", "太太的情人", "情茧", "新堕落东京之奴隶", "伟哥的故事", "世间女子多放荡", "三级蔷薇之恋", "三十年细说从头", "枪下新娘", "把妹达人", "有爱才有性", "不懂事的妻子的双重生活", "人形少女", "雪在烧", "花心大坏蛋", "素女真经", "色欲之死", "错位的青春", "凶爱：约会强暴", "惊变1996", "丑闻夫人：让我死去十秒", "丑闻夫人", "肉体", "我们的前女友", "女体铳", "机密重案之致命诱惑", "大咸湿", "禁色", "绝种贱男之爱在三级的日子", "黄昏大丽花", "发电俏娇娃", "不文小丈夫之银座嬉春", "恶魔2018", "丹麦娇娃", "池女", "监禁姐妹教师", "和服家政妇", "吃人的秘宝箱", "迷你宝贝", "亲切的兰子", "所知道的她的一切", "爱与痛的边缘", "角色扮演：铺垫", "奇奇欲爱世界", "三十儿立", "天使1996", "欲兽", "应召女郎", "桃色响尾蛇", "马丁的恋情", "带你嫖韩日", "金牛座符号", "96超级床上接班人", "哎呀女朋友", "百分百挑逗", "夺命剪刀屌", "监禁逃亡", "漂亮的儿媳妇", "为性疯狂", "弹珠机交际花", "她的呻吟", "纯粹的激情", "教嫂", "Stag", "足部按摩", "性交减肥", "驯服小媳妇", "中年男人与年轻女老板", "客户的优惠服务", "美味的皮肤", "与儿媳同居的岳父", "女孩的兴奋液体", "魅力十足的男人", "邻家小姐", "监禁逃亡1992", "勾引我的已婚女人", "我一直想这样做", "推开隔壁的门", "继母的魅力", "爱人的欺骗", "家庭主妇的诱惑", "同事的妻子", "姐夫的欲望", "通奸调查组", "骗子2024", "双性恋", "亲蜜情人之无限诱惑", "喝醉的隔壁女孩", "姊妹年糕味道", "29的秘密性三角", "继母：对不起", "嫂子的VIP服务", "甜蜜释放", "性感司机的愤怒", "姊妹湿性感区", "房东的诱惑", "好色的女领导", "透明女孩的故事", "寡妇的性别", "通缉：女朋友", "没有他的快乐日记", "黑丝女人的哭泣", "女大学生与烦人学长", "已婚妇女的轨迹", "继母的美好", "离家出走的女大学生", "和爸爸一起工作", "比基尼继母", "年轻的妈妈", "课中坏事", "被邀请的男人", "交换的一天", "不羁夜", "她们", "黑骚特警组", "我自己的爱达荷", "女子高生 殺人日記", "身体的痛苦", "肉食的动物", "巴黎Q娘", "Siskaeee： Keramat Tunggak", "暗恋你", "罪恶纵横 Bisyo!", "欲望舞场", "高潮吧！性鬼人间 性鬼人間第二号", "快乐的秘密室", "你还爱我妈", "私钟真面目", "素女经之挑情宝鉴", "洛杉矶韩国女性", "洞内交易", "我想成为你的客人", "按摩师的技术", "出轨朋友的丈夫", "Paraluman", "红色比基尼", "婚礼当天失去的纯洁", "爱一个人", "嫂子惩罚我", "新城妈妈", "大学生的味道", "夏娃的诱惑：吻", "寻找里美", "最后的深爱", "危险的中毒", "性的研究", "夏娃的诱惑：她的技巧", "哥哥的老婆", "亲切的家政妇", "青春礼赞", "来看我吧", "浪漫派丈夫的信", "妻子的借口", "玫瑰汽车旅馆", "刺青", "婚姻的起源", "谎言", "肌肤的纹理", "演员就是演员", "最后的慰安妇", "野狗们", "家政婦は見た! 20", "出轨", "天使", "兄弟的女人", "小女人的味道", "交换：朋友的妻", "年幼的嫂子", "与众不同的事", "夫妻的赞助商", "新的哥哥", "礼仪老师", "密爱：我朋友的妈妈", "恋爱谈", "邻家姐姐", "红色：危险的诱惑", "化学反应", "爱玛夫人", "贪婪", "酒吧", "女演员的性丑闻", "入伍前夕", "一起去吃拉面吗？", "奇怪的姐姐", "欲望三姐妹", "酒神小姐", "深夜剧场", "七公主驾到", "诚实国度的爱丽丝", "红色骆驼", "法外之徒：卑劣的街头", "激情假期", "凯蒂夫人 Salon Kitty", "爱欲夜知味", "欢乐之街", "小妈妈", "年轻的丈夫", "出轨的味道", "隔壁的女孩", "延边女士风味季", "自由夫人", "两个妈妈", "不道德的故事", "五十道格雷阴影的性传奇", "记得香蕉成熟时", "霓虹牛", "蔓延", "施工中", "霓虹肉身", "蓝宇", "致命美德：爱.荣誉.服从", "我朋友的老婆", "魔屋", "灭门惨案II借种", "猛鬼舔人", "假日惊情", "恋爱的目的", "保持站立", "粉红色杀人夜", "放荡青春", "巴黎最后的探戈", "打蛇", "罗曼史", "杀人鬼的女人", "酸世代", "买下我", "黑太阳731", "第一夫人S秘密", "春潮烂漫海棠红", "洛可", "人肉机器：蛊毒", "英雄無淚", "女生宿舍", "挡不住的疯情", "女犯罪史", "德国恐惧", "强制措施", "欲望之翼 La Chiave", "雌猫们", "性的张力短片集", "啊，荒野 后篇", "羔羊-医生", "东京难民", "花容月貌", "芋虫", "青春梦工场", "爱情攻略 小姐誘心", "再见歌舞伎町", "棕榈摆动", "花蕊：背德禁恋", "埃贡·席勒：过度", "变态观测", "东京暴族", "地球防卫遗孀", "弱杀", "我唾弃你的坟墓", "一部塞尔维亚电影", "樱姬", "春心荡漾", "恩娇", "垂帘听政", "陷阱2015", "爱情与灵药2010", "欧洲性旅行", "邪1980", "销魂玉", "声色犬马", "皇帝保重", "爱妹物语", "93夜之女", "不文小丈夫", "秋天怨曲之超级舞男", "兼职女郎", "冷月亮", "极度兽性", "夺命哥罗方", "迷情时空交叉点", "人肉腊肠", "虐之恋", "迷失乐园", "人皮高跟鞋", "三度偷情", "发廊里的美妙", "初恋1996", "快乐工厂", "三个女人的美味艳遇", "美味的性 姐姐朋友", "舞者的秘密教学", "女明星大绯闻", "美女律师", "赤裸羔羊", "90分钟", "下流的海女", "年轻的表妹们", "情难自制", "不扣钮的女孩", "东瀛风情蕩女豪放之女僕部屋", "夏丽蒂，内裤湿了", "按摩房的女大学生", "父亲的情人", "山鹰之歌", "坏小子2001", "新员工", "人猿泰山成人版", "妓女天使", "美味速递", "女性上位时代", "女子侦探事务所", "妻子的通奸", "十手舞", "透明变态人间", "特区爱奴", "停不了的爱", "登山的目的", "土耳其浴场110号：水母天堂", "陷阱2012", "五月樱唇", "夏日狂情", "西西里的美丽传说", "新任女老师", "性之教典48式", "性本恶", "淫贱四大才子", "塔蒂亞娜", "与蛇共舞", "制服诱惑", "自由恋爱时代", "你想改变吗", "韩国阿姨", "老婆的姐姐", "AV演员在首尔", "夜车司机：全程", "示范销售", "善良嫂子：无法忍受的日子", "妻子的秘密按摩", "波多野结衣", "女孩的叔叔", "列车上的已婚妇女", "学生的妈妈", "继父2018", "白昼先生", "新村站3号出口", "市中心的牛奶厂", "姐姐的日记", "亲自体验成人商店的她们", "母女的秘密授课", "年轻嫂子的惩罚", "按摩房的女大学生们", "小姑娘", "花吻在上OVA~恋人的羁绊～", "妻子姐姐教我姿势", "猎物-妻子的朋友", "肮脏的妻子", "坏小姨", "被阿姨诱惑的邻家小伙子", "阿拉斯加北极熊", "恋爱暴君OVA", "兄弟姐妹", "床上丽拉", "小弟弟", "兄弟的妻子", "夫妻交换", "一起沐浴的家教", "高潮餐厅", "夫妻互换的秘密", "夫妻交换的日子", "观察者", "关系：特别的嫂子", "邻居家妻子", "旁观者2019", "贪图兄长", "隔壁的姐妹们", "不良侦探：失踪", "漂亮模特姐妹", "和前辈夫妇的交换", "交换：两个女孩", "亲弟弟", "美味的家教", "新妈妈2019", "江南媳妇", "冲浪同学会", "姐妹们-监禁的回忆", "顶级生活", "25岁的女高中生", "Eternity ～深夜的濡恋频道～", "女人的战争之我是陶器", "女忍关原", "女侦探玛丽", "女子监狱秘图", "蒙古公主", "女天气预报员", "女人们：我来教你", "密写！紧缚拷问", "지명 가능한 고급술집녀", "地味变!!～改变土妹子的纯洁异性交往～", "女上班族的性按摩体验", "想成为继母的女人", "兄弟的火", "年轻的妻子和小叔子", "梨泰院巴士", "高潮前夕", "桃色夫人", "性收藏革命", "上流时代", "继兄妹", "成人设备使用手册", "我妻子的年轻母亲", "昭和爱神蔷薇贵妇人", "董事秘书 安奈", "昭和禁宫不为人知的故事", "专为女生服务的男钟点工", "战友的遗书", "招かれざる客", "丈夫看见了", "名人送妓女服务", "遥遥乡愁", "越线的女人", "春之钟", "艶熟母", "明智小五郎美女", "78days", "欲望之年轻的助手", "游戏规则1994", "愛の緊縛レッスン 入門編", "宇能鸿一郎之桃子", "隐密忍者 饿鬼姐妹", "明智小五郎美女系列11：樱之国的美女", "淫欲菩萨", "夜晚的诊察室", "一切都太疯狂了", "一个好妈妈", "義理の息子は覗き魔", "燕山日记", "艷色", "妖女传说", "野生馬", "野蛮谷处女", "続悪徳医", "性轮回", "凶＜まがまがし＞２ 凭霊", "新妻は浮気症", "像犀牛角一样一个人走吧", "仙女之泣", "夏天的秘密", "我妻子的新妈妈", "雾霭像女人一样低吟", "襲られた女", "未亡人と女教師", "我妹妹的朋友", "温柔的手", "特殊的精油按摩", "桃尻娘 ラブアタック", "混乱生活", "団地妻 隣人との性虐遊戯", "随性而为", "胎儿密猎时刻", "汤殿山麓诅咒村", "探险旅行", "十六岁的战争", "饲育的房间", "色狱女囚", "若叶学院：樱桃男孩", "傻瓜宣言", "若妻家庭教师", "日本暴力地帯 美しき野望", "性奴", "人鬼親情", "调教", "非常火热的后妈", "取立屋本舗ベビィ 闇金絵巻", "热裤", "墙上的女人", "女作家的隐秘私生活", "霹雳智多星", "妻子的诱惑", "朋友的妈妈：朋友的母亲和妻子", "红辣椒 Paprika", "前任空姐羽田惠理子", "女囚処刑人", "女囚Ｋ濡れた過去の女たち", "女人的战争之肮脏的交易", "女雀士杏子", "奴隶未亡人", "女家教：毒亲的玩具", "美容室：特殊服务2", "目迷五色", "萌えキュン 恋するメイドカフェ", "奈奈和熏的日记", "内衣杀人案", "裸虫", "虜\u3000ＴＯＲＩＫＯ\u3000ザ・ボディ", "美女在隐匿处的日式按摩", "猫女孩", "六本木ヤンキー戦争", "链-两个女人的诱惑", "良好的执行力：替代妻子", "愚蠢的女人：隔壁女孩与朋友妈妈", "东京大学美容导师", "麻将女神传", "李秀与情夫", "黎巴嫩感情", "一次性外遇 ", "劳拉的欲望", "快乐的保姆", "教習所のお姉さん ひとみ", "可疑诊疗室：特殊待遇", "金翅鸟之梦", "精神分裂症：妓女绞肉机", "出嫁的妹妹", "婚活バトルロワイアル", "婚后外遇", "监禁2018", "快乐方程式", "荒野上的情人", "化学反应2016", "谎言2014", "黒革の嬢王 欲望の仮面", "鬼灯家的大姐姐", "韩国男人在巴黎", "官能小説", "豪情欢乐街", "轻井泽夫人", "浮恋", "风骚俏佳人", "东京地下女子刑务所第3章", "東京地下女子刑務所 CHAPTER1・エリア88", "餌", "꽃을 든 남자", "大哥的情妇", "大学生的女仆初体验", "깃발을 꽂으며", "东京爆裂战争 上卷", "性用品店后台", "男女豹笼献祭狂欢", "老式口味", "年轻的曼加", "机械RQ", "红色梦想", "已婚女性的危险想象", "已婚孕妇的忏悔咒语", "乡村花卉", "三姐妹Noraebang", "妻子在丈夫面前做", "女大学生按摩", "猥亵的秘密的自白", "高阳的车", "洗屋先生！～我和那家伙在女浴池", "Kaew Khn Helk", "内部性报告", "新晋女教师不朽旋律", "母女性战争", "偷窥女教师", "2比1–男校友和女校友", "管家的诱惑", "Anak Titipan", "告白手记", "同性恋的兴奋", "Buy Me", "即便如此也是家人", "借我岳母的下裙", "Theuxin公司", "Jan Dara的开始", "日本女馆主人被韩国客人征服", "Larn Ruk Lum Thom", "惩罚迟到的兼职人员", "喜欢与分享", "裸拳", "Must Do It", "淫秽的苹果", "Panti Pijat", "性欲的囚徒的呼吸", "大嫂的湿洞", "性感秘书", "一起乘坐出租车", "姐姐 都是谎言", "停在车站的楼梯上", "导师的感动", "酒桌上的身体", "被拍卖的女人", "大嫂湿洞", "性欲囚徒：莉莉的呼吸", "Afam", "男女校友", "即便如此的家人", "同性恋欧巴我会让你兴奋", "我借一些嫂子的下裙", "Gancet Part", "记忆力", "日本柳馆女主人被韩国客人征服", "助理和Mertua", "痴女教室", "惩罚一名迟到的兼职人员", "与Lom一起乘坐出租车", "Bokep", "STW Part", "歌舞厅欲望", "业余情侣", "美容院：特殊服务", "一个善良的AV明星", "Birahi Muda", "Khang Hod Daen Theuxn", "如果你愿意，给你的一个性派对", "Pepaya Gantung", "在胶囊旅馆向上司传递微热的夜晚", "妓女的秘密生产", "Na Winyan Hia的节目", "STW Partk", "中年夫妻交换", "被控制的女人", "妻子在眼前被侵犯", "Wikwik", "三上优亚", "Rak si si hawci si saw", "海滩上采摘鲍鱼的味道", "快乐地狱", "爱的一夜", "我想被爱", "呼叫年轻女护士的治疗", "Lonte Part", "姐妹养老餐厅", "性欲点燃魅力", "帮摔倒的准新娘按摩", "烧腊", "私人秘书的深夜", "闹鬼的辣妹", "Netoraserare", "Pantaxa Laiya Ep1", "秘密咨询中心", "女机械人", "扑克之王：航空公司", "我的白色野兽笼", "小女儿们", "好女孩（好女人）", "小型俱乐部", "99 Moons", "我家门口的女孩", "爱之泉", "欲望之死", "妻子的性幻想", "新婚妻子的猫咪", "年少妻子的自白令人震惊！", "一对奇怪的性伴侣", "文艺青年", "他们都是侄子", "霍莉的双重曝光", "被打倒的瑜伽女孩", "犯罪女孩：发情的小巷猫", "做到就可以摘下", "Sssshhh", "湿了，请放进去。", "性感女人的展示", "Reing Rak Ni Dng Phir", "Sapul", "与男朋友户外约会", "笼中之花", "按摩店的商业秘密", "两个高尔夫女孩", "更衣室金小姐", "2对1老客户", "秋子的日本梦", "捆绑十字架", "夫欺骗妻子", "猫之夜", "湿润的下部", "咖啡馆女老板", "Rak Tae Faen Mai", "朋友的母亲突然落水", "Satan Phiswas", "河童之恋", "性恶魔男2号伊基纳赛", "陷阱：通奸的女人", "第一任性教练传授技能", "垃圾女人", "置于危险之中", "姐姐日记", "性恶魔男1号发情", "Ang Huling Birhen sa Lupa", "通奸合同", "女老板和男员工", "情侣喜欢在浴室里", "Haman", "被卡住了你喜欢吗", "爱兽攻击！", "MZ世代交换", "按摩送递", "Paupahan", "交换工作室", "拷问贵妇人III", "性的质量", "性宫淫花处处开", "妹妹的品味", "漂亮身体的女孩", "宝贝一起做", "灵幻新娘", "我们社区的美味女士", "帐篷里的味道", "新粉红窗帘", "洗衣女工", "美味的婆婆", "一个拳击业余选手", "只对叔叔开放的洞穴", "Cuatro", "红色响尾蛇", "鬼之敬", "可怕假期", "一个在性中背弃的女人", "4人4性", "美少女妹：诱惑", "已婚男人与已婚女人", "朋友妈妈睡觉时摸我", "郊区的隔音旅馆", "妻子变成娃娃被吃掉", "变色狼", "五月的红唇", "处女的满足条件", "聪明的夫妻的性生活", "出轨岳父的儿媳妇", "送货女郎：男人的梦想", "喜欢放弃的职场女人", "Stalkers", "5年家庭主妇的性公开", "原来是个花蛇高尔夫教练", "岳母游戏", "新女员工：出差", "30岁的韩国女性更喜欢按摩", "OL适合同居的年龄", "虚伪的味道", "交换情侣的世界", "双飞滋味", "身材好天天换男人的离婚女人", "Domme", "我把我的妻子借给你", "危险乳房搭便车", "和妈妈分享男朋友", "Katawan", "监禁之酷刑", "婆婆执着地舔遍全身", "淫秽小屋：可疑长寿药", "性饥渴旅游集团的猥亵计划", "Rs Raj Klin Saw", "Salamat Daks", "罪恶的姐妹", "交换：2比1", "20岁女大学生的秘密兼职", "Upuan", "热舞女孩的转身", "没有其他女大学生", "爱上岳父的儿媳妇", "女阴阳师 淫魔受胎", "Chain", "El man del porno", "兽欲魔乱行", "开卖的女士", "饥渴姐妹", "优质按摩", "嫉妒游戏", "情趣酒店：无空位", "现场表演的最佳1和2", "Lawa", "已婚女子职场性骚扰", "秘书专业", "相亲对象是强硬的问题学生", "50后成熟婆婆的诱惑", "基督之书", "新七擒七纵七色狼", "轻松进入", "爱的边界", "夺回MZ的欧巴", "被老板取笑的新女员工", "爱喷的寡妇", "欲望少女", "别脱那内裤", "不要觊觎你妻子的朋友", "天真的你会被吃掉", "性动力", "独居女性", "脱衣麻将 偶像战国时代", "被性感婆婆吸引", "妻子如花", "快乐之家", "Suki", "中年夫妇的秘密交换", "我姑姑身体的秘密", "朋友和已婚女人的外遇", "味道", "残酷的监禁", "La Querida", "前面后面", "我要你，娜娜酱", "Lagaslas", "打高尔夫球的女人", "伊莉丝的深色调", "听叔叔的妻子", "富人调情", "秘书与朋友三人行", "妹妹的VIP粉丝室", "博索多斯酒店", "带胸肌的男人", "20岁的兼职工作", "放荡的色号", "Mang Kanor", "请粗暴点", "夜晚的恋人", "妻子的按摩师", "10日情人", "Bela Luna", "田径爱情", "交换妻子", "高尔夫情侣：19洞", "Grand Jete", "我偷了朋友的女朋友", "我不需要男人", "她对套不满意", "第一次的味道", "偷窥孔", "出租妻子", "异族通婚", "偷看嫂子的内幕", "接吻练习", "哥哥我要", "秘密美发沙龙", "和嫂子住一起", "继父和母女", "她的秘密契约", "继母的身体", "Aishiteru!", "隔壁的少妇", "Fuck Sex", "护士宿舍", "年糕女孩", "大号套", "村上玲奈", "高尔夫学生和已婚妇女", "嫂子的开放花瓣", "危险小屋", "牛奶大姐夫", "标记：起点", "处女和朋友妈妈", "直立守护者", "与律师共度一夜", "玉割", "唐朝禁宫酷刑", "完全饲育 etude", "心动的导师", "三角恋2018", "乡愁2015", "平成风俗史", "韩国最强上班族女郎系列", "女CEO的薪水", "韩国岳母女婿爱情合集", "夜鸟", "老板的办公室玩具", "Secret Mission～潜入捜査官绝对不会输", "衣冠楚楚的管家", "东京的澪夫人", "15岁的妻子", "妻子的工作", "韩国性代表", "年轻的兼职人员", "10年AV男优的课堂", "D罩杯爱好者", "年轻男人和老女人", "可爱女士宿舍", "白日梦1981", "千代女", "Bugso", "昂贵的糖果", "朋友的丈夫", "Officetel 女大学生", "办公室女孩", "修理工：女人", "谢谢（Arigatou）", "邻家男人", "暮光之城吸血鬼", "客人三人行", "喜欢脱衣服的管家", "守望者女孩", "花痴的秘密", "女教授和学生", "三人爱恋", "韩国推荐官", "渴望爱的已婚妇女", "暴饮暴食", "护士的特殊护理", "漂亮继母", "上瘾夫妻的不忠", "养女：成为女人", "新女员工的味道", "幸福游艇", "性感的腰部", "妻子专用健身教练", "18班的Ara", "做我奴隶", "贝尔酒店", "进洞！来吧！", "女高报告：花样开放的夕子", "妻子的专属健身教练", "粉红色的妇女", "新女忍者", "初次体验的秘诀", "三人场景", "全职家庭主妇", "无耻性欲", "帅气的儿媳妇", "高跟鞋惩罚者", "嫂子监视姐夫", "请抱紧我", "偷情出差", "欲望的酒店", "好女儿的故事", "丈夫出差后", "处女的满足", "Laruan", "韩国AV女优", "红楼梦01", "无胸罩瑜伽课", "公司合作伙伴", "人体模型之夜", "病房：SM诊所", "Pamasahe", "里面的性", "暗恋：丈夫出差", "像这样的东西", "生存女孩", "可疑的一年级", "鹿老师", "实习生和女老板", "透明女孩的第二个故事", "丈夫面前的妻子", "业主的诱惑", "新妻子出轨", "发情的男人和女人", "春女怪谈", "新倾国倾城", "爱的精灵", "萝犯", "濡れた的欲情", "东京十日谈", "我的女孩去哪了", "18岁的教室", "换妻档案", "卡车上的坏人", "家庭按摩院的特别服务", "美容院已婚妇女", "最后一对", "Koaswat Hardswun 1", "年轻女仆的目的", "乐美儿", "东京妓院", "我们 X 她", "应召生涯", "4 秒系列：女大学生", "94应召女郎", "Alapaap", "导演和AV女演员", "D罩杯的设计", "养老金客人", "红唇滚滚", "摄影之爱", "饥饿的猫", "情爱魔力", "生死与共", "按摩后的女员工", "她的第二个故事", "超女 XXX", "经理的恶作剧", "比生鱼片更美味的", "高级工作2", "身陷铁栅的发情女性", "蝙蝠宝贝", "ChaoNarng", "分娩按摩", "天使女孩诱惑", "少女母亲的自白", "未知的所有", "交换情侣", "欲望告诉我你的愿望", "Dong Dok Ngeo", "绝望的爱", "1982年的智英", "Kara Krus", "三打一", "淫豪妖情", "Libido", "我妻子的朋友", "快乐或痛苦", "新员工换岗会", "我的第一份工作", "殉道与快乐", "Sarpseir", "烈火女警花", "兽性难驯", "都会性男女", "嫂子的冲动", "老板娘的加班费", "武田 千代女", "骗子规则", "二十五和二十", "保守的泳衣", "奇怪的亲戚", "经理妻子的家政服务", "制服酒肉祭", "夜王誕生", "两个女人的诱惑", "坏侦探：食物链", "美味交换", "问题已婚妇女", "善良女儿的秘密", "合作伙伴交换", "爱心护士", "再见。继母", "护士的特殊治疗", "欲望丈夫", "陷入魔咒的女人", "酒店温存", "美味女孩的炫耀", "用身体让嫂子闭嘴", "交换：美味姐妹", "2对1分享", "大妞", "被老师操纵的女人", "女大学生的秘密工作", "不要睡觉", "朋友姐妹", "24小时开放", "她隐藏的秘密", "嫂子的性教育", "美国禁忌", "女郎市场", "18 岁的乔是个热情的女孩", "F 罩杯的奶水太棒了", "O 的故事", "一丝不挂", "一乐也 1973", "一发双中，父子齐射", "一树梨花压海棠", "一路向西", "三剑侠与飞机妹", "三夫", "三奸", "上瘾夫妻的不伦本能", "上门教宅男接吻的美女讲师", "下众之爱", "不可撤销", "不知不觉诱惑你", "不穿胸罩晾衣服并揉搓的嫂子", "与女上司的禁忌出差之旅", "与女友妹妹的小号秘恋", "与女教授的二次激战", "与我同眠", "与醉酒女上司的禁忌夜晚", "专挑新员工下手的美女女上司", "世界尽头的爱", "丽塔", "乐之街", "乾隆下扬州", "事后帮忙打扫的继母・真由酱", "云上的日子", "五十度", "交通费", "人人都能上的年糕", "人工性智能", "人鱼传说 1984", "仁光受难记", "今天轮到谁挥棒？", "从白天开始做，嘴巴磨破了的女人", "你妈妈也一样", "你的妈妈做得很好", "你的性伙伴", "俄罗斯妈妈", "倩女幽魂 1960", "偷窥", "偷窥情人", "偷窥无罪", "偷窥狂人", "偷窥的欲望", "偷香", "僵尸脱衣舞娘", "克洛伊", "公主与女仆", "公主恋人 OVA", "公公试探儿媳的房事默契", "六月之蛇", "再见箱舟", "再见艾曼妞", "军阀趣史", "冤罪", "凯蒂夫人", "凶宅胭脂", "勾当 2：红色骆驼", "勾魂恶梦", "北地胭脂", "十年后重逢，被老师掌控的她", "十年爱", "十楼的蚊子", "午夜守门人", "华丽的外出", "卿本佳人", "历劫俏佳人", "厨房春光", "双姝艳", "变态家族：长兄的新娘", "变身成黑辣妹之后就和死党上床了。", "台北晚九朝五", "同床 2 梦", "同班同学", "同船爱歌", "后宫：帝王之妾", "向喜欢的女同事表白 3", "周末夫妇", "和天使一样肮脏", "唐朝豪放女", "喜欢前后运动的隔壁性感女", "喜欢婶婶刚脱下的内裤", "因为女儿的男朋友而尝到了男人的滋味", "在出差地被上司多次弄到高潮的女职员", "在我面前湿透了的妻子的妈妈", "地狱解剖", "坏小子 2001", "坏时机", "处女器官", "夜又临", "大开眼戒", "大波诱惑", "失恋杀人", "头等舱的极品女 紫色芳香", "夹在发情男人中的性感女佣", "奈莉 2016", "女上司的前列腺极致挑逗", "女上司的欲望裂缝", "女仆的安慰食物", "女儿的朋友", "女医生的性治疗", "女友的妈妈", "女大学生被性欲主导的快感", "女子学校拷问部", "女朋友的妈妈", "女老板的居酒屋进补日", "女职员：职场恋爱", "女色狼", "奸情", "奸臣", "奸魔", "好想和老师", "好的开始", "好色一代男", "妻子的朋友约我单独见面后脱了衣服", "姐妹情室", "姐姐的 S 丑闻", "娜塔莉的情人", "娼年", "婶婶面前的羞耻排泄", "嫂子的诱惑", "嫌我邋遢还给我洗澡的嫂子", "子曰：食色性也", "学生的母亲", "安塔芮丝", "完美护士的不轨行为", "官能的法则", "家族性史", "家访后，被家长调教的女教师", "对不起，继母与爸爸", "少妇的诱惑", "尸囚狱：前篇", "尸油 3D", "屠夫小姐", "屯门色魔", "工作女郎", "巴黎野玫瑰", "布拉格之恋", "年轻妻子的工作：超 VIP 美容俱乐部", "年轻的亚当", "年轻的嫂子", "幸福出租车", "幻影 2000", "延边女士", "录影片段", "徐老虎与白寡妇", "微交少女", "性冷淡", "性启蒙：公公的亲身教学", "性暴力档案", "性欲怪兽 朋友的妈妈由美酱", "性谈牡丹灯笼", "恋之罪", "恋人濡湿", "恋爱的味道", "悬崖上的野餐", "情不自禁 1991", "情人 1992", "情妇 1975", "情迷六月花", "情迷维纳斯", "愉悦与苦痛", "感受大海的时刻", "感官世界", "慈禧秘密生活", "戏梦巴黎", "成熟妇人的秘密午后", "我为卿狂", "我们", "我们都是超能力者！", "我嫁了个怪蜀黍！", "A片", "我朋友的老姐", "我来自北京", "我的变态情人", "我的美好欲望", "战国洛克：疾风女人们", "拈花惹草", "拳拳到肉", "振荡器", "捆着我，绑着我", "捉奸趣事", "撒玛利亚女孩", "撩乱的裸舞曲", "教室别恋", "斩王", "新妈妈", "新妹魔王的契约者", "新建文件夹", "无水之池", "无法控制的性欲", "无颜之月", "明明不喜欢", "有时候要像一个娼妇", "朋友也上床", "未知方程式", "李霸妮的秘密俱乐部", "杏林春暖", "极道咸湿", "枕边书", "桃色经纪", "楼上的女孩", "榨干每一滴的老师", "欲动", "欲望之翼", "欲望办公室：女上司的私密命令", "欲望沐浴：继母与姨妈", "欲望酒店", "欲诱", "武松 1982", "残酷异常虐待物语：元禄女系图", "每天偷偷和我做的邻家姐姐", "毫无顾忌地与嫂子纵情发射", "水浒传之英雄好色", "沙西米", "没有被爱过的女人", "沦为债主情妇的妻子", "洛丽塔", "活色生香", "浪得过火", "海角上的兄妹", "深层解放，亲手抚慰的按摩师", "港澳传奇", "湖畔的陌生人", "湿濡的女人", "湿谷秘探", "湿黏肉感熟女", "溜溜性感女孩警察", "满清十大酷刑", "满清禁宫奇案", "激情丛林", "激情信箱", "激情惊爆点", "瀛台泣血", "火口的两人", "灭门惨案之孽杀", "烈性摔跤", "烈火情人", "三级片", "热点服务：一个残忍的理发师", "热线女孩", "爱之女巫", "爱之涡", "爱欲轮回", "爱神 2004", "牛鬼蛇神", "猛男诞生记：开始变强", "献身师父的女弟子", "玛利亚和旅店", "珍品", "甜点情人", "甜蜜电影", "甜蜜皮鞭", "生日女郎", "皇帝保重", "睡美人 2017", "短发女子丰满胸部与朦胧的下体", "禁止的爱", "种鬼", "秘书 2002", "秘密的画舫", "空气人偶", "童贞男的初恋 神木丽", "竹夫人", "米兰达", "红心女王", "红辣椒 1991", "红鞋日记", "继母会好好疼你的", "继母突然全副武装", "艳情史", "罗马的房子", "美丽的图画", "美人图", "美女器官", "羞耻", "老处女的私密诱惑", "老娘我最辣", "老婆的朋友目睹了你惊人的大物", "聊斋之鬼狐", "聚会的目的", "肉体的本能", "脱光肉感妹，玩转极乐王游戏", "腥红假期", "舞男情未了", "色即是空", "色模", "艳舞女郎", "艾曼纽", "花芯 2016", "花街柳巷", "花飞满城春", "花鸟笼", "苦月亮", "菜鸟的发情治疗机", "萨德侯爵", "虚张声势", "蛇与鞭", "蛇魔追魂阵 1992", "被不穿内衣的儿媳征服的绝伦公公", "被变态跟踪的新人女教师", "被女婿征服的岳母", "被欲望唤醒的办公室女孩", "被讨厌的学长紧紧拥抱的女大学生", "裸吻", "解放的潘多拉", "请做我的奴隶", "谁在偷看奥利弗", "赛琳娜的黄金", "赤裸天使", "赶尸艳谈", "跑到我床上却不让我自慰的妈妈朋友", "身体轮廓的秘密", "迷上黑人巨物的人气博主", "迷于女友朋友臀部的男友", "迷宫：秘密爱", "逃离快乐星球", "那个少女不多情之脱的疑惑", "邻家姐姐的致命曲线", "醉酒少女误入陌生人怀抱", "野兰花", "金钱之味", "钢琴教师", "钱的味道", "铁轮", "阿黛尔的生活", "隐藏的面孔", "隔壁姐姐的性教育", "难以忘怀前男友的大棒滋味", "雍女传", "雷鱼", "露营的意义", "露西亚的情人", "青春学堂", "风月奇谭", "风流名妓苏小小", "风流韵事", "风花雪月", "香港奇案", "骗财骗色", "高校教师 成熟", "鬼叫春", "鸭王", "鹅毛笔", "麗蘭", "黑天使")) {
            if (str.contains(str2)) {
                return true;
            }
        }
        return false;
    }

    public static JSONObject N() {
        int i;
        try {
            yq = new JSONObject(C0052.m2261(m1035(), 918, 267, 745));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static JSONObject SN() {
        int i;
        try {
            yq = new JSONObject(C0005.m169(m1035(), 1185, 267, 1210));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static void W(String str) {
        boolean z = C0037.m1888(str, C0024.m1513(m1035(), 1452, 3, 372));
        String str2 = C0031.m1705();

        if (z) {
            V v = m1034();
            C0003.m107(v);
            IL il = C0035.m1813(m1034());
            C0001.m42(il);
            C0031.m1691(il);
            v.t0 = il;
            v.zH = str2;
            jt jtVar = C0033.m1757(m1034());
            C0013.m408(jtVar);
            C0055.m2322(jtVar);
            v.M = jtVar;
            Yv yv = C0057.m2362(m1034());
            C0039.m1930(yv);
            C0029.m1661(yv);
            v.Gc = yv;
        }
        boolean z2 = C0037.m1888(str, C0020.m1390(m1035(), 1455, 5, 2974));

        if (z2) {
            C0023.m1462(C0007.m219());
        }
        boolean z3 = C0037.m1888(str, C0034.m1781(m1035(), 1460, 2, 2092));

        if (z3) {
            C0056.m2344(C0055.m2311());
        }
        boolean z4 = C0037.m1888(str, C0015.m457(m1035(), 1462, 2, 1670));

        if (!z4) {
            return;
        } else {
            RQ rq = C0008.m243();
            C0020.m1392(C0049.m2179(rq));
            Q6 q6 = C0015.m439(rq);
            C0022.m1451(q6);
            rq.W = q6;
            rq.F5 = str2;
            OM om = C0030.m1673(rq);
            C0020.m1366(om);
            C0022.m1436(om);
            rq.v = om;
            T1 t1 = C0023.m1464(rq);
            C0050.m2213(t1);
            rq.G = t1;
            C0002.m62(rq);
            return;
        }
    }

    public static JSONObject dT() {
        int i;
        try {
            yq = new JSONObject(C0032.m1749(m1035(), 1464, 270, 1534));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static File ee() {
        StringBuilder sb = new StringBuilder();
        C0025.m1533(sb, C0012.m375());
        File file = new File(C0032.m1739(sb, C0056.m2348(), C0051.m2237(m1035(), 1734, 2, 402)));
        boolean z = C0001.m36(file);

        if (!(z)) {
            C0024.m1503(file);
        }
        return file;
    }

    public static JSONObject g9() {
        int i;
        try {
            yq = new JSONObject(C0002.m57(m1035(), 1736, 267, 1809));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static File i(File file) {
        try {
            File file2 = C0023.m1480(file);

            if (!(file2 == null)) {
                File file3 = C0023.m1480(file);
                boolean z = C0001.m36(file3);
                if (!(z)) {
                    C0024.m1503(file3);
                }
            }
            boolean z2 = C0024.m1524(file);

            if (!(z2)) {
                C0015.m448(file, true);
            }
            boolean z3 = C0001.m36(file);

            if (!(z3)) {
                C0000.m5(file);
            }
            StringBuilder sb = new StringBuilder();
            C0032.m1746(sb, C0010.m296(m1035(), 2003, 10, 1967));
            C0025.m1533(sb, file);
            try {
                int i5 = C0048.m2163(C0023.m1478(C0039.m1924(), C0043.m2039(sb)));

                if (i5 != 0) {
                    StringBuilder sb2 = new StringBuilder();
                    C0032.m1746(sb2, C0042.m2010(m1035(), 2013, 36, 3020));
                    C0034.m1785(sb2, i5);
                    throw new RuntimeException(C0043.m2039(sb2));
                } else {
                    StringBuilder sb2 = new StringBuilder();
                    C0032.m1746(sb2, C0042.m2010(m1035(), 2013, 36, 3020));
                    C0034.m1785(sb2, i5);
                    throw new RuntimeException(C0043.m2039(sb2));
                }
            } catch (Exception e) {
                C0011.m342(e);
            }
        } catch (Exception e2) {
            C0011.m342(e2);
        }
        return file;
    }

    public static JSONObject q() {
        int i;
        try {
            yq = new JSONObject(C0049.m2175(m1035(), 2049, 268, 2423));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static long t0(long j) {
        long j2 = 0;
        long j3 = 0;
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        int i4 = 0;
        int i5 = 0;
        int i6 = 0;
        Calendar calendar = null;
        Date date = null;
        String str = "ۥۤۢ";
        while (true) {
            switch (C0002.m76(str)) {
                case 56291:
                j3 = j2 & 63;
                str = "ۢ۠ۡ";
                break;
                case 56389:
                i = (int) j3;
                str = "ۣۧۥ";
                break;
                case 56477:
                j2 = j >> 21;
                str = "ۢۤ۟";
                break;
                case 56542:
                j3 = j2 & 31;
                str = "ۦۥۦ";
                break;
                case 1746783:
                j2 = C0031.m1706(date);
                str = "ۡ۠ۧ";
                break;
                case 1746819:
                j2 = j3 & 127;
                str = "ۦۦۤ";
                break;
                case 1747748:
                j2 = j3 - 1;
                str = "ۣۨۧ";
                break;
                case 1747750:
                date = C0037.m1871(calendar);
                str = "۟ۢۢ";
                break;
                case 1748648:
                j3 = j >> 32;
                str = "ۢ۟ۦ";
                break;
                case 1748889:
                C0037.m1879(calendar, 14, 0);
                str = "۠ۢۨ";
                break;
                case 1749577:
                j = j2 + j3;
                str = "ۤۡۨ";
                break;
                case 1749603:
                i2 = (int) j3;
                str = "ۣۧ۠";
                break;
                case 1749725:
                j3 = j2 & 15;
                str = "۠ۢۦ";
                break;
                case 1750692:
                j2 = j >> 16;
                str = "ۧۥ";
                break;
                case 1750721:
                j3 = j2 & 31;
                str = "ۣۨۥ";
                break;
                case 1750785:
                j2 = j >> 5;
                str = "۟ۢ";
                break;
                case 1751563:
                return j;
                case 1752488:
                j3 = j2 & 62;
                str = "ۢۧ";
                break;
                case 1752611:
                j2 = j << 1;
                str = "ۥۣ۠";
                break;
                case 1753607:
                i4 = (int) j3;
                str = "ۥۢ";
                break;
                case 1753636:
                j3 = j2 + 1980;
                str = "ۦۧۧ";
                break;
                case 1753670:
                i6 = (int) j3;
                str = "۠ۦ۠";
                break;
                case 1754410:
                j2 = j >> 11;
                str = "ۣۥۣ";
                break;
                case 1754444:
                C0053.m2289(calendar, i6, i5, i4, i3, i2, i);
                str = "ۡۨ۠";
                break;
                case 1755370:
                j3 = j >> 25;
                str = "ۣ۟ۧ";
                break;
                case 1755466:
                i3 = (int) j3;
                str = "ۣۤۥ";
                break;
                case 1755468:
                i5 = (int) j2;
                str = "ۨ۠ۢ";
                break;
                default:
                calendar = C0036.m1856();
                str = "ۧۡۦ";
                break;
            }
        }
    }

    public static JSONObject tF() {
        int i;
        try {
            yq = new JSONObject(C0052.m2261(m1035(), 2317, 265, 2329));
            i = 1616;
        } catch (JSONException e) {
            m1032(e);
        }
        return m1033();
    }

    public static JsonObject v(String str) {
        try {
            JsonElement jsonElement = m1030(str);

            JsonObject jsonObject = m1036(jsonElement);
            if (jsonObject != null) {
                return jsonObject;
            } else {
                return new JsonObject();
            }
        } catch (Throwable th) {
            C0011.m342(th);
            return new JsonObject();
        }
    }

    /* JADX WARN: Code restructure failed: missing block: B:150:?, code lost:
    return r0;
    */
    /* JADX WARN: Code restructure failed: missing block: B:151:?, code lost:
    return r0;
    */
    /* JADX WARN: Code restructure failed: missing block: B:27:0x004e, code lost:
    r2 = 48891;
    */
    /* JADX WARN: Code restructure failed: missing block: B:28:0x0051, code lost:
    r2 = r2 ^ 48908;
    */
    /* JADX WARN: Code restructure failed: missing block: B:29:0x0055, code lost:
    switch(r2) {
        case 22: goto L106;
        case 53: goto L105;
        case 503: goto L107;
        case 32495: goto L108;
        default: goto L112;
    };
    */
    /* JADX WARN: Code restructure failed: missing block: B:30:0x0059, code lost:
    r2 = 48953;
    */
    /* JADX WARN: Code restructure failed: missing block: B:31:0x005d, code lost:
    if (r0 == r8) goto L110;
    */
    /* JADX WARN: Code restructure failed: missing block: B:32:0x005f, code lost:
    r2 = 49635;
    */
    /* JADX WARN: Code restructure failed: missing block: B:33:0x0063, code lost:
    r3 = com.github.catvod.spider.merge.C0026.m1568(r5, r6, r7 + r0, r8 - r0);
    r2 = 49666;
    */
    /* JADX WARN: Code restructure failed: missing block: B:34:0x006e, code lost:
    r2 = r2 ^ 49683;
    */
    /* JADX WARN: Code restructure failed: missing block: B:35:0x0072, code lost:
    switch(r2) {
        case 17: goto L115;
        case 50: goto L116;
        case 76: goto L104;
        case 83: goto L117;
        default: goto L121;
    };
    */
    /* JADX WARN: Code restructure failed: missing block: B:36:0x0076, code lost:
    if (r3 != (-1)) goto L118;
    */
    /* JADX WARN: Code restructure failed: missing block: B:37:0x0078, code lost:
    r2 = 49759;
    */
    /* JADX WARN: Code restructure failed: missing block: B:38:0x007c, code lost:
    r2 = 49728;
    */
    /* JADX WARN: Code restructure failed: missing block: B:39:0x0080, code lost:
    r2 = 49790;
    */
    /* JADX WARN: Code restructure failed: missing block: B:40:0x0083, code lost:
    r2 = r2 ^ 49807;
    */
    /* JADX WARN: Code restructure failed: missing block: B:41:0x0087, code lost:
    switch(r2) {
        case 18: goto L124;
        case 51: goto L127;
        case 84: goto L126;
        case 241: goto L125;
        default: goto L131;
    };
    */
    /* JADX WARN: Code restructure failed: missing block: B:42:0x008b, code lost:
    r2 = 49852;
    */
    /* JADX WARN: Code restructure failed: missing block: B:43:0x008f, code lost:
    if (r0 != 0) goto L129;
    */
    /* JADX WARN: Code restructure failed: missing block: B:44:0x0091, code lost:
    r2 = 49883;
    */
    /* JADX WARN: Code restructure failed: missing block: B:46:0x0096, code lost:
    return -1;
    */
    /* JADX WARN: Code restructure failed: missing block: B:47:0x0097, code lost:
    r0 = r0 + r3;
    r2 = 49914;
    */
    /* JADX WARN: Code restructure failed: missing block: B:48:0x009b, code lost:
    r2 = r2 ^ 49931;
    */
    /* JADX WARN: Code restructure failed: missing block: B:49:0x009f, code lost:
    switch(r2) {
        case 497: goto L135;
        case 1711: goto L134;
        default: goto L137;
    };
    */
    /* JADX WARN: Code restructure failed: missing block: B:50:0x00a3, code lost:
    r2 = 50596;
    */
    /*
    Code decompiled incorrectly, please refer to instructions dump.
    To view partially-correct add '--show-bad-code' argument
    */
    public static int v3(java.io.InputStream r5, byte[] r6, int r7, int r8) {
        /*
        Method dump skipped, instructions count: 410
        To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: com.github.catvod.spider.merge.FO.v3(java.io.InputStream, byte[], int, int):int");
    }

    public static byte[] zH(char[] cArr) {
        try {
            ByteBuffer byteBuffer = C0010.m321(C0001.m47(), C0013.m383(cArr));
            byte[] bArr = new byte[C0046.m2130(byteBuffer)];
            C0032.m1732(byteBuffer, bArr);
            return bArr;
        } catch (Exception e) {
            byte[] bArr2 = new byte[cArr.length];
            int i = 0;
            while (true) {
                int length = cArr.length;

                if (i < length) {
                    bArr2[i] = (byte) cArr[i];
                    i++;
                } else {
                    return bArr2;
                }
            }
        }
    }

    /* renamed from: بظغك  reason: contains not printable characters */
    public static JsonElement m1030(Object obj) {
        int i = C0051.m2229();

        if (i > 0) {
            return null;
        } else {
            return JsonParser.parseString((String) obj);
        }
    }

    /* renamed from: ثبﺽﻉ  reason: contains not printable characters */
    public static JsonElement m1031(Object obj, Object obj2) {
        int i = C0040.m1954();

        if (i > 0) {
            return null;
        } else {
            return ((JsonParser) obj).parse((String) obj2);
        }
    }

    /* renamed from: جفﺱﻍ  reason: contains not printable characters */
    public static void m1032(Object obj) {
        int i = C0044.m2051();

        if (i > 0) {
            return;
        } else {
            SpiderDebug.log((Throwable) obj);
            return;
        }
    }

    /* renamed from: طﺕثﺥ  reason: contains not printable characters */
    public static JSONObject m1033() {
        int i = C0034.m1793();

        if (i > 0) {
            return null;
        } else {
            return yq;
        }
    }

    /* renamed from: ـﺽقر  reason: contains not printable characters */
    public static V m1034() {
        int i = C0045.m2093();

        if (i <= 0) {
            return null;
        } else {
            return V.SN.yq;
        }
    }

    /* renamed from: وعﻱخ  reason: contains not printable characters */
    public static short[] m1035() {
        int i = C0053.m2279();

        if (i >= 0) {
            return null;
        } else {
            return f58short;
        }
    }

    /* renamed from: ﺝاذس  reason: contains not printable characters */
    public static JsonObject m1036(Object obj) {
        int i = C0015.m447();

        if (i <= 0) {
            return null;
        } else {
            return ((JsonElement) obj).getAsJsonObject();
        }
    }

    @Override // com.github.catvod.spider.merge.Pu
    public a9 yq(String str) {
        return C0037.m1884();
    }
}
