package com.github.catvod.spider;

import android.content.Context;
import android.text.TextUtils;
import com.github.catvod.crawler.SpiderDebug;
import com.github.catvod.parser.C0000;
import com.github.catvod.parser.C0001;
import com.github.catvod.parser.C0002;
import com.github.catvod.parser.C0003;
import com.github.catvod.parser.C0004;
import com.github.catvod.parser.C0005;
import com.github.catvod.parser.C0006;
import com.github.catvod.parser.C0007;
import com.github.catvod.parser.C0009;
import com.github.catvod.parser.C0010;
import com.github.catvod.parser.C0011;
import com.github.catvod.parser.C0012;
import com.github.catvod.parser.C0013;
import com.github.catvod.parser.C0014;
import com.github.catvod.spider.merge.A7;
import com.github.catvod.spider.merge.C0021;
import com.github.catvod.spider.merge.C0023;
import com.github.catvod.spider.merge.C0024;
import com.github.catvod.spider.merge.C0026;
import com.github.catvod.spider.merge.C0027;
import com.github.catvod.spider.merge.C0028;
import com.github.catvod.spider.merge.C0029;
import com.github.catvod.spider.merge.C0030;
import com.github.catvod.spider.merge.C0031;
import com.github.catvod.spider.merge.C0032;
import com.github.catvod.spider.merge.C0033;
import com.github.catvod.spider.merge.C0034;
import com.github.catvod.spider.merge.C0035;
import com.github.catvod.spider.merge.C0036;
import com.github.catvod.spider.merge.C0037;
import com.github.catvod.spider.merge.C0038;
import com.github.catvod.spider.merge.C0040;
import com.github.catvod.spider.merge.C0065Ku;
import com.github.catvod.spider.merge.C0068Pe;
import com.github.catvod.spider.merge.PA;
import com.github.catvod.spider.merge.Rc;
import com.github.catvod.spider.merge.Va;
import com.github.catvod.spider.merge.eb;
import com.github.catvod.spider.merge.hN;
import com.github.catvod.spider.merge.jv;
import com.github.catvod.spider.merge.kB;
import com.github.catvod.spider.merge.rN;
import java.net.URLEncoder;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashMap;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;
import org.json.JSONArray;
import org.json.JSONObject;
/* loaded from: E:\develop\workspace\private\Playhub\tvbox\decompiled\response\classes_inner.dex */
public class WoGG extends Pan {
    private static boolean n;

    /* renamed from: short  reason: not valid java name */
    private static final short[] f55short = {2230, 2218, 2218, 2222, 2221, 2276, 2289, 2289, 2217, 2225, 2233, 2233, 2288, 2214, 2214, 2225, 2225, 2225, 2288, 2237, 2232, 2289, 720, 649, 656, 667, 667, 666, 651, 670, 662, 659, 720, 727, 675, 667, 724, 726, 721, 663, 651, 658, 659, 587, 617, 636, 623, 618, 618, 615, 553, 563, 552, 566, 550, 558, 593, 623, 616, 610, 617, 625, 629, 550, 584, 594, 550, 567, 566, 552, 566, 573, 550, 593, 623, 616, 560, 562, 573, 550, 638, 560, 562, 559, 550, 583, 630, 630, 618, 611, 593, 611, 612, 589, 618, 626, 553, 563, 565, 561, 552, 565, 560, 550, 558, 589, 590, 594, 587, 586, 554, 550, 618, 623, 621, 611, 550, 577, 611, 613, 621, 617, 559, 550, 581, 622, 628, 617, 619, 611, 553, 567, 565, 563, 552, 566, 552, 566, 552, 566, 550, 597, 615, 608, 615, 628, 623, 553, 563, 565, 561, 552, 565, 560, 1271, 1201, 1197, 1204, 1205, 513, 1515, 1522, 1529, 1518, 1525, 1522, 1514, 1458, 1422, 1411, 1436, 1476, 1415, 1413, 1422, 1439, 1414, 1423, 1479, 1411, 1438, 1423, 1415, 1579, 1574, 1593, 1633, 1570, 1568, 1579, 1594, 1571, 1578, 1634, 1574, 1595, 1578, 1570, 1634, 1599, 1574, 1580, 1649, 1582, 3169, 3196, 3169, 3193, 3184, 2021, 2017, 2027, 1954, 2016, 2029, 2038, 2037, 2016, 2019, 2029, 2024, 2025, 2024, 1535, 1530, 1519, 1530, 1462, 1512, 1513, 1528, 2778, 2775, 2760, 2704, 2771, 2769, 2778, 2763, 2770, 2779, 2707, 2775, 2762, 2779, 2771, 2707, 2762, 2779, 2758, 2762, 2725, 2728, 2743, 2799, 2732, 2734, 2725, 2740, 2733, 2724, 2796, 2728, 2741, 2724, 2732, 2796, 2722, 2720, 2737, 2741, 2728, 2734, 2735, 2785, 2738, 2737, 2720, 2735, 2310, 2332, 2315, 2312, 808, 817, 826, 769, 823, 826, 2167, 2158, 2149, 2142, 2159, 2144, 2156, 2148, 1305, 1280, 1291, 1328, 1311, 1286, 1292, 2543, 2550, 2557, 2502, 2539, 2556, 2548, 2552, 2539, 2546, 2538, 707, 730, 721, 746, 716, 720, 724, 711, 1776, 1718, 1706, 1715, 1714, 2421, 2412, 2407, 2407, 2406, 2423, 2402, 2410, 2415, 2348, 1641, 1636, 1659, 1571, 1659, 1636, 1641, 1640, 1634, 1568, 1646, 1634, 1659, 1640, 1663, 1581, 1641, 1636, 1659, 1571, 1632, 1634, 1641, 1656, 1633, 1640, 1568, 1636, 1657, 1640, 1632, 1568, 1661, 1636, 1646, 1581, 1636, 1632, 1642, 1571, 1633, 1644, 1655, 1652, 1633, 1634, 1644, 1641, 3264, 3277, 3285, 2916, 2913, 2932, 2913, 2861, 2931, 2930, 2915, 1401, 1396, 1387, 1331, 1387, 1396, 1401, 1400, 1394, 1328, 1396, 1395, 1403, 1394, 1328, 1396, 1385, 1400, 1392, 1390, 2733, 2734, 2751, 2736, 2800, 2728, 2743, 2746, 2747, 2737, 2803, 2743, 2736, 2744, 2737, 2803, 2743, 2730, 2747, 2739, 2730, 2743, 2730, 2738, 2747, 2347, 2342, 2361, 2401, 2361, 2342, 2347, 2346, 2336, 2402, 2342, 2337, 2345, 2336, 2402, 2342, 2363, 2346, 2338, 23733, 26970, -1368, 24072, 27360, -1298, 1220, 428, 19152, 27647, -1039, 24448, 20247, -274, 23394, 27072, -2529, 24049, -32379, 24250, 16919, 1783, 1705, 1780, 1782, 1773, 1773, 1752, 1766, 1700, 25545, -29816, -27113, 21753, 1698, 1273, 1268, 1259, 1203, 1259, 1268, 1273, 1272, 1266, 1200, 1268, 1267, 1275, 1266, 1200, 1276, 1256, 1253, 1213, 1276, 3323, 3318, 3305, 3249, 3305, 3318, 3323, 3322, 3312, 3250, 3318, 3313, 3321, 3312, 3250, 3326, 3306, 3303, 3263, 3233, 3263, 3323, 3318, 3305, 3249, 3307, 3326, 3320, 3250, 3315, 3318, 3313, 3316, 3263, 3326, 2062, 2051, 2076, 2116, 2076, 2051, 2062, 2063, 2053, 2119, 2051, 2052, 2060, 2053, 2119, 2059, 2079, 2066, 2122, 2132, 2122, 2059, 2116, 2078, 2059, 2061, 2119, 2054, 2051, 2052, 2049, 2222, 2227, 2222, 2230, 2239, -538, -31979, 23943, -537, 3066, 2000, 2348, 2357, 2366, 2309, 2355, 2366, 2341, 2364, 2359, 2316, 2365, 2354, 2366, 2358, 3162, 3139, 3144, 3187, 3164, 3141, 3151, 3272, 3281, 3290, 3297, 3271, 3291, 3295, 3276, 2715, 2690, 2697, 2738, 2719, 2696, 2688, 2700, 2719, 2694, 2718, 1430, 1423, 1412, 1471, 1409, 1411, 1428, 1423, 1426, 1922, 1947, 1936, 1963, 1936, 1949, 1926, 1937, 1943, 1920, 1947, 1926, 2204, 2181, 2190, 2229, 2185, 2181, 2180, 2206, 2191, 2180, 2206, 2480, 2473, 2466, 2457, 2471, 2484, 2467, 2471, 2506, 2503, 2510, 2523, 2529, 2512, 2527, 2515, 2523, 2741, 2744, 2737, 2724, 2718, 2725, 2720, 2735, 2732, 2740, 455, 458, 469, 397, 462, 460, 455, 470, 463, 454, 398, 465, 460, 468, 398, 458, 461, 453, 460, 387, 413, 387, 450, 540, 537, 524, 537, 597, 539, 532, 529, 520, 538, 535, 537, 522, 540, 597, 524, 541, 512, 524, 1946, 1934, 1939, 1937, 1935, 3159, 3147, 3142, 3166, 3156, 1131, 1131, 1131, 2850, 2875, 2864, 2827, 2852, 2872, 2869, 2861, 2827, 2849, 2854, 2872, 2806, 2799, 2788, 2783, 2800, 2796, 2785, 2809, 2783, 2790, 2802, 2799, 2797, 23402, -29558, -28655, 28428, -30420, 27384, 22938, -29501, 20708, -30600, -1180, 32545, 23829, 23467, 19154, -29683, 2292, 2289, 2283, 2284, 901, 921, 921, 925, 983, 962, 962, 922, 898, 906, 906, 925, 908, 899, 963, 981, 981, 981, 985, 981, 985, 963, 917, 916, 919, 962, 1134, 1138, 1138, 1142, 1084, 1065, 1065, 1137, 1129, 1121, 1121, 1064, 1150, 1150, 1129, 1129, 1129, 1064, 1125, 1120, 1065, 794, 774, 774, 770, 840, 861, 861, 791, 790, 789, 791, 797, 796, 789, 860, 773, 797, 789, 789, 860, 833, 833, 833, 832, 833, 832, 860, 778, 779, 776, 861, 2012, 1984, 1984, 1988, 1934, 1947, 1947, 1987, 1987, 1987, 1946, 1987, 2011, 2003, 2003, 1946, 2008, 2013, 1986, 2001, 1947, 2003, 1999, 1999, 1995, 1921, 1940, 1940, 1996, 2004, 2012, 2012, 1995, 2010, 2005, 1941, 1928, 1928, 1928, 1929, 1928, 1929, 1941, 1987, 1986, 1985, 1940, 3271, 3291, 3291, 3295, 3221, 3200, 3200, 3288, 3288, 3288, 3201, 3288, 3264, 3272, 3272, 3201, 3265, 3274, 3291, 3200, 3063, 3055, 3047, 3047, 3039, 3059, 3049, 3060, 3045, 2153, 2146, 2168, 2159, 2156, 2147, 3307, 3232, 3238, 3306, 3252, 3244, 3252, 3323, 3249, 3254, 3240, 3321, 2353, 2339, 2324, 2327, 2324, 2307, 2324, 2307, 2380, 2329, 2309, 2309, 2305, 2306, 2379, 2398, 2398, 2320, 2305, 2328, 2399, 2325, 2334, 2308, 2323, 2320, 2335, 2399, 2322, 2334, 2332, 2398, 2353, 2340, 2306, 2324, 
    2307, 2396, 2352, 2326, 2324, 2335, 2309, 2380, 2364, 2334, 2315, 2328, 2333, 2333, 2320, 2398, 2372, 2399, 2369, 2385, 2393, 2342, 2328, 2335, 2325, 2334, 2310, 2306, 2385, 2367, 2341, 2385, 2368, 2369, 2399, 2369, 2378, 2385, 2342, 2328, 2335, 2375, 2373, 2378, 2385, 2313, 2375, 2373, 2392, 2385, 2352, 2305, 2305, 2333, 2324, 2342, 2324, 2323, 2362, 2328, 2309, 2398, 2372, 2370, 2374, 2399, 2370, 2375, 2385, 2393, 2362, 2361, 2341, 2364, 2365, 2397, 2385, 2333, 2328, 2330, 2324, 2385, 2358, 2324, 2322, 2330, 2334, 2392, 2385, 2354, 2329, 2307, 2334, 2332, 2324, 2398, 2368, 2368, 2369, 2399, 2369, 2399, 2369, 2399, 2369, 2385, 2338, 2320, 2327, 2320, 2307, 2328, 2398, 2372, 2370, 2374, 2399, 2370, 2375, 1622, 1614, 1606, 1606, 1662, 1618, 1608, 1621, 1604, 2416, 2412, 2412, 2408, 1577, 1580, 1590, 1585, 2497, 30519, 23923, 1478, 20515, -27518, 2984, 2984, -30427, 22455, 2335, 29113, 27007, 21555, 2259, 22317, 27310, 2227, 29724, -30566, 614, 612, 31968, 23839, 28685, 2045, -24644, 17951, 1902, 1889, 1892, 1916, 1901, 1914, 1915, 2077, 2064, 2063, 2135, 2068, 2070, 2077, 2060, 2069, 2076, 2132, 2069, 2064, 2071, 2076, 2058, 2132, 2069, 2064, 2058, 2061, 2125, 2112, 2143, 2055, 2116, 2118, 2125, 2140, 2117, 2124, 2052, 2112, 2141, 2124, 2116, 2293, 2296, 2279, 2239, 2300, 2302, 2293, 2276, 2301, 2292, 2236, 2296, 2277, 2292, 2300, 2236, 2273, 2296, 2290, 2223, 2288, 733, 704, 733, 709, 716, 2445, 2441, 2435, 2506, 2440, 2437, 2462, 2461, 2440, 2443, 2437, 2432, 2433, 2432, 1884, 1881, 1868, 1881, 1813, 1867, 1866, 1883, 1804, 1793, 1822, 1862, 1797, 1799, 1804, 1821, 1796, 1805, 1861, 1793, 1820, 1805, 1797, 1861, 1803, 1801, 1816, 1820, 1793, 1799, 1798, 1864, 1819, 1816, 1801, 1798, 3236, 3241, 3254, 3310, 3245, 3247, 3236, 3253, 3244, 3237, 3309, 3241, 3252, 3237, 3245, 3309, 3252, 3237, 3256, 3252, 2848, 2874, 2861, 2862, 1513, 1520, 1531, 1472, 1526, 1531, 1691, 1666, 1673, 1714, 1667, 1676, 1664, 1672, 2751, 2726, 2733, 2710, 2745, 2720, 2730, 1564, 1541, 1550, 1589, 1560, 1551, 1543, 1547, 1560, 1537, 1561, 543, 518, 525, 566, 528, 524, 520, 539, 2442, 2437, 2440, 2458, 2458, 1360, 1354, 1367, 1350, 1398, 1361, 1359, 2595, 2619, 2611, 2611, 1738, 1736, 1752, 1759, 1744, 2240, 2268, 2268, 2264, 1368, 1345, 1354, 1373, 1355, 1359, 1372, 1357, 1350, 1281, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1283, 1280, 1350, 1370, 1347, 1346, 1297, 1369, 1354, 1299, 2396, 2385, 2382, 2326, 2389, 2391, 2396, 2381, 2388, 2397, 2325, 2379, 2397, 2393, 2378, 2395, 2384, 2325, 2385, 2380, 2397, 2389, 1469, 1456, 1455, 1527, 1455, 1456, 1469, 1468, 1462, 1524, 1456, 1463, 1471, 1462, 1524, 1457, 1468, 1464, 1469, 1468, 1451, 1529, 1529, 1457, 1514, 1529, 1529, 1464, 843, 838, 857, 769, 857, 838, 843, 842, 832, 770, 838, 833, 841, 832, 770, 839, 842, 846, 843, 842, 861, 783, 846, 769, 857, 838, 843, 842, 832, 770, 860, 842, 861, 838, 846, 835, 883, 894, 865, 825, 890, 888, 883, 866, 891, 882, 826, 894, 867, 882, 890, 826, 871, 894, 884, 823, 894, 890, 880, 1505, 1508, 1521, 1508, 1448, 1526, 1527, 1510, 3287, 3277, 3290, 3289, 551, 574, 565, 526, 568, 565, 2298, 2275, 2280, 2259, 2274, 2285, 2273, 2281, 3050, 3059, 3064, 3011, 3052, 3061, 3071, 3078, 3103, 3092, 3119, 3074, 3093, 3101, 3089, 3074, 3099, 3075, 2236, 2233, 2211, 2212};
    private String O = C0053.m2276(f55short, 0, 22, 2270);
    private Pattern g1 = Pattern.compile(C0038.m1903(f55short, 22, 21, 767));
    private String s = C0027.m1601(f55short, 43, 111, 518);

    /* renamed from: سخﺽﺯ  reason: contains not printable characters */
    public static short[] m997() {
        if (C0013.m382() <= 0) {
            return f55short;
        }
        return null;
    }

    /* renamed from: طنـم  reason: contains not printable characters */
    public static String m998(Object obj) {
        if (C0046.m2112() > 0) {
            return ((WoGG) obj).s;
        }
        return null;
    }

    /* renamed from: ﺽسوﺫ  reason: contains not printable characters */
    public static void m999(Object obj) {
        if (C0051.m2229() < 0) {
            SpiderDebug.log((Throwable) obj);
        }
    }

    /* renamed from: ﻉـﺡق  reason: contains not printable characters */
    public static String m1000(Object obj) {
        if (C0023.m1475() > 0) {
            return ((WoGG) obj).O;
        }
        return null;
    }

    public String categoryContent(String str, String str2, boolean z, HashMap<String, String> hashMap) {
        String str3 = C0037.m1882(f55short, 154, 5, 1241);
        String str4 = C0031.m1713(f55short, 159, 1, 556);
        String str5 = C0050.m2224(f55short, 160, 8, 1437);
        try {
            String[] strArr = {"", "", "", "", "", "", "", "", "", "", "", ""};
            strArr[0] = str;
            strArr[8] = str2;
            if (hashMap != null && hashMap.size() > 0) {
                for (String str6 : hashMap.keySet()) {
                    strArr[Integer.parseInt(str6)] = URLEncoder.encode(hashMap.get(str6));
                }
            }
            JSONObject jSONObject = new JSONObject();
            JSONArray jSONArray = new JSONArray();
            String v = C0068Pe.v(this.O + str5 + TextUtils.join(str4, strArr) + str3, Rc.M(this.s), 5);
            if (Rc.ee(v)) {
                v = refTry(str5 + TextUtils.join(str4, strArr) + str3);
            }
            kB cS = rN.yq(v).cS(C0033.m1764(f55short, 168, 15, 1514));
            for (int i = 0; i < cS.size(); i++) {
                hN hNVar = cS.get(i);
                hN tF = hNVar.cS(C0036.m1850(f55short, 183, 21, 1615)).tF();
                String N = tF.N(C0053.m2276(f55short, 204, 5, 3093));
                String pic = getPic(PA.yq(C0001.m35(f55short, 209, 14, 1932), hNVar).N(C0046.m2123(f55short, 223, 8, 1435)));
                String Fo = PA.yq(C0028.m1613(f55short, 231, 20, 2750), hNVar).Fo();
                String Fo2 = PA.yq(C0011.m328(f55short, 251, 28, 2753), hNVar).Fo();
                Matcher matcher = this.g1.matcher(tF.N(C0004.m130(f55short, 279, 4, 2414)));
                if (matcher.find()) {
                    String group = matcher.group(1);
                    JSONObject jSONObject2 = new JSONObject();
                    jSONObject2.put(C0034.m1781(f55short, 283, 6, 862), group);
                    jSONObject2.put(C0050.m2224(f55short, 289, 8, 2049), N);
                    jSONObject2.put(C0003.m86(f55short, 297, 7, 1391), pic);
                    jSONObject2.put(C0050.m2224(f55short, 304, 11, 2457), Fo);
                    jSONObject2.put(C0024.m1513(f55short, 315, 8, 693), Fo2);
                    jSONArray.put(jSONObject2);
                }
            }
            eb.t0(jSONArray, jSONObject, str2);
            return jSONObject.toString();
        } catch (Exception e) {
            SpiderDebug.log(e);
            return "";
        }
    }

    /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
        jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 366
        	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:70)
        	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:44)
        */
    @Override // com.github.catvod.spider.Pan
    public java.lang.String detailContent(java.util.List<java.lang.String> r24) {
        /*
            Method dump skipped, instructions count: 2078
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: com.github.catvod.spider.WoGG.detailContent(java.util.List):java.lang.String");
    }

    public void getKey() {
        String yq = new jv().yq(new ArrayList(Arrays.asList(C0010.m296(f55short, 792, 26, 1005), C0005.m169(f55short, 818, 21, 1030), C0012.m361(f55short, 839, 31, 882), C0002.m57(f55short, 870, 21, 1972), C0035.m1833(f55short, 891, 26, 1979), C0040.m1953(f55short, 917, 20, 3247))));
        this.O = yq;
        if (yq.length() > 4) {
            C0065Ku.i(C0040.m1953(f55short, 937, 9, 2944), this.O);
        }
    }

    public String getPic(String str) {
        if (!str.contains(C0050.m2224(f55short, 946, 6, 2061))) {
            return str;
        }
        return str.replace(C0045.m2098(f55short, 952, 12, 3268), "") + C0009.m277(f55short, 964, 155, 2417);
    }

    public void getSite() {
        String tF = C0065Ku.tF(C0052.m2261(f55short, 1119, 9, 1569));
        if (tF.contains(C0012.m361(f55short, 1128, 4, 2328))) {
            this.O = tF;
        } else {
            getKey();
        }
    }

    public String homeContent(boolean z) {
        JSONArray jSONArray;
        JSONObject jSONObject;
        JSONArray jSONArray2;
        kB cS;
        int i;
        String str = C0010.m296(f55short, 1132, 4, 1605);
        try {
            jSONArray = new JSONArray();
            jSONObject = new JSONObject();
            eb.Gc(C0003.m86(f55short, 1136, 1, 2544), C0010.m296(f55short, 1137, 2, 514), jSONArray);
            eb.Gc(C0000.m18(f55short, 1139, 1, 1524), C0035.m1833(f55short, 1140, 2, 580), jSONArray);
            eb.Gc(C0014.m421(f55short, 1142, 2, 2972), C0049.m2175(f55short, 1144, 2, 2270), jSONArray);
            eb.Gc(C0054.m2301(f55short, 1146, 1, 2345), C0050.m2224(f55short, 1147, 3, 1620), jSONArray);
            eb.Gc(C0031.m1713(f55short, 1150, 1, 2272), C0009.m277(f55short, 1151, 2, 1413), jSONArray);
            eb.Gc(C0013.m380(f55short, 1153, 1, 2183), C0006.m180(f55short, 1154, 2, 2784), jSONArray);
            eb.Gc(C0055.m2320(f55short, 1156, 2, 594), C0044.m2052(f55short, 1158, 3, 586), jSONArray);
            eb.Gc(C0031.m1713(f55short, 1161, 1, 1992), C0055.m2320(f55short, 1162, 2, 2127), jSONArray);
            String v = C0068Pe.v(this.O, Rc.M(this.s), 3);
            if (Rc.ee(v)) {
                v = refTry(this.O);
            }
            Va yq = rN.yq(v);
            if (z) {
                jSONObject.put(C0030.m1688(f55short, 1164, 7, 1800), new JSONObject("{\"1\":[{\"key\":\"3\",\"name\":\"类型\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"喜剧\",\"v\":\"喜剧\"},{\"n\":\"爱情\",\"v\":\"爱情\"},{\"n\":\"动作\",\"v\":\"动作\"},{\"n\":\"恐怖\",\"v\":\"恐怖\"},{\"n\":\"科幻\",\"v\":\"科幻\"},{\"n\":\"剧情\",\"v\":\"剧情\"},{\"n\":\"犯罪\",\"v\":\"犯罪\"},{\"n\":\"奇幻\",\"v\":\"奇幻\"},{\"n\":\"战争\",\"v\":\"战争\"},{\"n\":\"悬疑\",\"v\":\"悬疑\"},{\"n\":\"武侠\",\"v\":\"武侠\"},{\"n\":\"冒险\",\"v\":\"冒险\"},{\"n\":\"古装\",\"v\":\"古装\"},{\"n\":\"历史\",\"v\":\"历史\"},{\"n\":\"惊悚\",\"v\":\"惊悚\"}]},{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"},{\"n\":\"2020\",\"v\":\"2020\"},{\"n\":\"2019\",\"v\":\"2019\"},{\"n\":\"2018\",\"v\":\"2018\"},{\"n\":\"2017\",\"v\":\"2017\"},{\"n\":\"2016\",\"v\":\"2016\"},{\"n\":\"2015\",\"v\":\"2015\"},{\"n\":\"2014\",\"v\":\"2014\"},{\"n\":\"2013\",\"v\":\"2013\"},{\"n\":\"2012\",\"v\":\"2012\"},{\"n\":\"2011\",\"v\":\"2011\"}]},{\"key\":\"1\",\"name\":\"地区\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"大陆\",\"v\":\"中国大陆\"},{\"n\":\"中国香港\",\"v\":\"中国香港\"},{\"n\":\"中国台湾\",\"v\":\"中国台湾\"},{\"n\":\"美国\",\"v\":\"美国\"},{\"n\":\"韩国\",\"v\":\"韩国\"},{\"n\":\"日本\",\"v\":\"日本\"},{\"n\":\"西班牙\",\"v\":\"西班牙\"},{\"n\":\"泰国\",\"v\":\"泰国\"},{\"n\":\"法国\",\"v\":\"法国\"},{\"n\":\"英国\",\"v\":\"英国\"},{\"n\":\"德国\",\"v\":\"德国\"},{\"n\":\"印度\",\"v\":\"印度\"},{\"n\":\"其他\",\"v\":\"其他\"}]}],\"44\":[{\"key\":\"3\",\"name\":\"类型\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"喜剧\",\"v\":\"喜剧\"},{\"n\":\"爱情\",\"v\":\"爱情\"},{\"n\":\"动作\",\"v\":\"动作\"},{\"n\":\"恐怖\",\"v\":\"恐怖\"},{\"n\":\"科幻\",\"v\":\"科幻\"},{\"n\":\"剧情\",\"v\":\"剧情\"},{\"n\":\"犯罪\",\"v\":\"犯罪\"},{\"n\":\"奇幻\",\"v\":\"奇幻\"},{\"n\":\"战争\",\"v\":\"战争\"},{\"n\":\"悬疑\",\"v\":\"悬疑\"},{\"n\":\"武侠\",\"v\":\"武侠\"},{\"n\":\"冒险\",\"v\":\"冒险\"},{\"n\":\"古装\",\"v\":\"古装\"},{\"n\":\"历史\",\"v\":\"历史\"},{\"n\":\"惊悚\",\"v\":\"惊悚\"}]},{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"},{\"n\":\"2020\",\"v\":\"2020\"},{\"n\":\"2019\",\"v\":\"2019\"},{\"n\":\"2018\",\"v\":\"2018\"},{\"n\":\"2017\",\"v\":\"2017\"},{\"n\":\"2016\",\"v\":\"2016\"},{\"n\":\"2015\",\"v\":\"2015\"},{\"n\":\"2014\",\"v\":\"2014\"},{\"n\":\"2013\",\"v\":\"2013\"},{\"n\":\"2012\",\"v\":\"2012\"},{\"n\":\"2011\",\"v\":\"2011\"}]},{\"key\":\"1\",\"name\":\"地区\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"大陆\",\"v\":\"中国大陆\"},{\"n\":\"中国香港\",\"v\":\"中国香港\"},{\"n\":\"中国台湾\",\"v\":\"中国台湾\"},{\"n\":\"美国\",\"v\":\"美国\"},{\"n\":\"韩国\",\"v\":\"韩国\"},{\"n\":\"日本\",\"v\":\"日本\"},{\"n\":\"西班牙\",\"v\":\"西班牙\"},{\"n\":\"泰国\",\"v\":\"泰国\"},{\"n\":\"法国\",\"v\":\"法国\"},{\"n\":\"英国\",\"v\":\"英国\"},{\"n\":\"德国\",\"v\":\"德国\"},{\"n\":\"印度\",\"v\":\"印度\"},{\"n\":\"其他\",\"v\":\"其他\"}]}],\"2\":[{\"key\":\"3\",\"name\":\"类型\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"喜剧\",\"v\":\"喜剧\"},{\"n\":\"爱情\",\"v\":\"爱情\"},{\"n\":\"动作\",\"v\":\"动作\"},{\"n\":\"恐怖\",\"v\":\"恐怖\"},{\"n\":\"科幻\",\"v\":\"科幻\"},{\"n\":\"剧情\",\"v\":\"剧情\"},{\"n\":\"犯罪\",\"v\":\"犯罪\"},{\"n\":\"奇幻\",\"v\":\"奇幻\"},{\"n\":\"战争\",\"v\":\"战争\"},{\"n\":\"悬疑\",\"v\":\"悬疑\"},{\"n\":\"武侠\",\"v\":\"武侠\"},{\"n\":\"冒险\",\"v\":\"冒险\"},{\"n\":\"古装\",\"v\":\"古装\"},{\"n\":\"历史\",\"v\":\"历史\"},{\"n\":\"惊悚\",\"v\":\"惊悚\"}]},{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"},{\"n\":\"2020\",\"v\":\"2020\"},{\"n\":\"2019\",\"v\":\"2019\"},{\"n\":\"2018\",\"v\":\"2018\"},{\"n\":\"2017\",\"v\":\"2017\"},{\"n\":\"2016\",\"v\":\"2016\"},{\"n\":\"2015\",\"v\":\"2015\"},{\"n\":\"2014\",\"v\":\"2014\"},{\"n\":\"2013\",\"v\":\"2013\"},{\"n\":\"2012\",\"v\":\"2012\"},{\"n\":\"2011\",\"v\":\"2011\"}]},{\"key\":\"1\",\"name\":\"地区\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"大陆\",\"v\":\"中国大陆\"},{\"n\":\"中国香港\",\"v\":\"中国香港\"},{\"n\":\"中国台湾\",\"v\":\"中国台湾\"},{\"n\":\"美国\",\"v\":\"美国\"},{\"n\":\"韩国\",\"v\":\"韩国\"},{\"n\":\"日本\",\"v\":\"日本\"},{\"n\":\"西班牙\",\"v\":\"西班牙\"},{\"n\":\"泰国\",\"v\":\"泰国\"},{\"n\":\"法国\",\"v\":\"法国\"},{\"n\":\"英国\",\"v\":\"英国\"},{\"n\":\"德国\",\"v\":\"德国\"},{\"n\":\"印度\",\"v\":\"印度\"},{\"n\":\"其他\",\"v\":\"其他\"}]}],\"6\":[{\"key\":\"3\",\"name\":\"类型\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"男频\",\"v\":\"男频\"},{\"n\":\"女频\",\"v\":\"女频\"},{\"n\":\"都市\",\"v\":\"都市\"},{\"n\":\"甜宠\",\"v\":\"甜宠\"},{\"n\":\"年代\",\"v\":\"年代\"},{\"n\":\"穿越\",\"v\":\"穿越\"},{\"n\":\"古装\",\"v\":\"古装\"},{\"n\":\"亲情\",\"v\":\"亲情\"},{\"n\":\"奇幻\",\"v\":\"奇幻\"},{\"n\":\"萌宝\",\"v\":\"萌宝\"},{\"n\":\"重生\",\"v\":\"重生\"},{\"n\":\"冒险\",\"v\":\"冒险\"},{\"n\":\"逆袭\",\"v\":\"逆袭\"},{\"n\":\"虐恋\",\"v\":\"虐恋\"},{\"n\":\"复仇\",\"v\":\"复仇\"},{\"n\":\"修仙\",\"v\":\"修仙\"},{\"n\":\"鉴宝\",\"v\":\"鉴宝\"}]},{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"}]}],\"5\":[{\"key\":\"5\",\"name\":\"字母\",\"value\":[{\"n\":\"A\",\"v\":\"A\"},{\"n\":\"B\",\"v\":\"B\"},{\"n\":\"C\",\"v\":\"C\"},{\"n\":\"D\",\"v\":\"D\"},{\"n\":\"E\",\"v\":\"E\"},{\"n\":\"F\",\"v\":\"F\"},{\"n\":\"G\",\"v\":\"G\"},{\"n\":\"H\",\"v\":\"H\"},{\"n\":\"I\",\"v\":\"I\"},{\"n\":\"J\",\"v\":\"J\"},{\"n\":\"K\",\"v\":\"K\"},{\"n\":\"L\",\"v\":\"L\"},{\"n\":\"M\",\"v\":\"M\"},{\"n\":\"N\",\"v\":\"N\"},{\"n\":\"O\",\"v\":\"O\"},{\"n\":\"P\",\"v\":\"P\"},{\"n\":\"Q\",\"v\":\"Q\"},{\"n\":\"R\",\"v\":\"R\"},{\"n\":\"S\",\"v\":\"S\"},{\"n\":\"T\",\"v\":\"T\"},{\"n\":\"U\",\"v\":\"U\"},{\"n\":\"V\",\"v\":\"V\"},{\"n\":\"W\",\"v\":\"W\"},{\"n\":\"X\",\"v\":\"X\"},{\"n\":\"Y\",\"v\":\"Y\"},{\"n\":\"Z\",\"v\":\"Z\"},{\"n\":\"0-9\",\"v\":\"0-9\"}]}],\"4\":[{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"},{\"n\":\"2020\",\"v\":\"2020\"},{\"n\":\"2019\",\"v\":\"2019\"},{\"n\":\"2018\",\"v\":\"2018\"},{\"n\":\"2017\",\"v\":\"2017\"},{\"n\":\"2016\",\"v\":\"2016\"},{\"n\":\"2015\",\"v\":\"2015\"},{\"n\":\"2014\",\"v\":\"2014\"},{\"n\":\"2013\",\"v\":\"2013\"},{\"n\":\"2012\",\"v\":\"2012\"},{\"n\":\"2011\",\"v\":\"2011\"}]},{\"key\":\"1\",\"name\":\"地区\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"大陆\",\"v\":\"中国大陆\"},{\"n\":\"中国香港\",\"v\":\"中国香港\"},{\"n\":\"中国台湾\",\"v\":\"中国台湾\"},{\"n\":\"美国\",\"v\":\"美国\"},{\"n\":\"韩国\",\"v\":\"韩国\"},{\"n\":\"日本\",\"v\":\"日本\"},{\"n\":\"西班牙\",\"v\":\"西班牙\"},{\"n\":\"英国\",\"v\":\"英国\"},{\"n\":\"其他\",\"v\":\"其他\"}]}],\"46\":[{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"},{\"n\":\"2020\",\"v\":\"2020\"},{\"n\":\"2019\",\"v\":\"2019\"},{\"n\":\"2018\",\"v\":\"2018\"},{\"n\":\"2017\",\"v\":\"2017\"},{\"n\":\"2016\",\"v\":\"2016\"},{\"n\":\"2015\",\"v\":\"2015\"},{\"n\":\"2014\",\"v\":\"2014\"},{\"n\":\"2013\",\"v\":\"2013\"},{\"n\":\"2012\",\"v\":\"2012\"},{\"n\":\"2011\",\"v\":\"2011\"},{\"n\":\"2010\",\"v\":\"2010\"}]}],\"3\":[{\"key\":\"11\",\"name\":\"年代\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\": \"2026\", \"v\": \"2026\"},{\"n\": \"2025\", \"v\": \"2025\"},{\"n\":\"2024\",\"v\":\"2024\"},{\"n\":\"2023\",\"v\":\"2023\"},{\"n\":\"2022\",\"v\":\"2022\"},{\"n\":\"2021\",\"v\":\"2021\"},{\"n\":\"2020\",\"v\":\"2020\"},{\"n\":\"2019\",\"v\":\"2019\"},{\"n\":\"2018\",\"v\":\"2018\"},{\"n\":\"2017\",\"v\":\"2017\"},{\"n\":\"2016\",\"v\":\"2016\"},{\"n\":\"2015\",\"v\":\"2015\"},{\"n\":\"2014\",\"v\":\"2014\"},{\"n\":\"2013\",\"v\":\"2013\"},{\"n\":\"2012\",\"v\":\"2012\"},{\"n\":\"2011\",\"v\":\"2011\"}]},{\"key\":\"1\",\"name\":\"地区\",\"value\":[{\"n\":\"全部\",\"v\":\"\"},{\"n\":\"大陆\",\"v\":\"中国大陆\"},{\"n\":\"美国\",\"v\":\"美国\"},{\"n\":\"日本\",\"v\":\"日本\"},{\"n\":\"韩国\",\"v\":\"韩国\"},{\"n\":\"英国\",\"v\":\"英国\"},{\"n\":\"法国\",\"v\":\"法国\"},{\"n\":\"其他\",\"v\":\"其他\"}]}]}"));
            }
            jSONArray2 = new JSONArray();
            cS = yq.cS(C0034.m1781(f55short, 1171, 21, 2169));
            i = 0;
        } catch (Exception e) {
            SpiderDebug.log(e);
            return "";
        }
        while (true) {
            int i2 = i;
            if (i2 < cS.size()) {
                kB cS2 = cS.get(i2).cS(C0014.m421(f55short, 1192, 15, 2089));
                for (int i3 = 0; i3 < cS2.size(); i3++) {
                    hN hNVar = cS2.get(i3);
                    hN tF = hNVar.cS(C0041.m1994(f55short, 1207, 21, 2193)).tF();
                    String N = tF.N(C0037.m1882(f55short, 1228, 5, 681));
                    String pic = getPic(PA.yq(C0003.m86(f55short, 1233, 14, 2532), hNVar).N(C0033.m1764(f55short, 1247, 8, 1848)));
                    String Fo = PA.yq(C0048.m2145(f55short, 1255, 28, 1896), hNVar).Fo();
                    String Fo2 = PA.yq(C0021.m1417(f55short, 1283, 20, 3264), hNVar).Fo();
                    Matcher matcher = this.g1.matcher(tF.N(C0035.m1833(f55short, 1303, 4, 2888)));
                    if (matcher.find()) {
                        String group = matcher.group(1);
                        try {
                            JSONObject jSONObject2 = new JSONObject();
                            jSONObject2.put(C0007.m210(f55short, 1307, 6, 1439), group);
                            jSONObject2.put(C0014.m421(f55short, 1313, 8, 1773), N);
                            jSONObject2.put(C0037.m1882(f55short, 1321, 7, 2761), pic);
                            jSONObject2.put(C0035.m1833(f55short, 1328, 11, 1642), Fo2);
                            jSONObject2.put(C0006.m180(f55short, 1339, 8, 617), Fo);
                            jSONArray2.put(jSONObject2);
                        } catch (Exception e2) {
                            SpiderDebug.log(e2);
                        }
                    }
                }
                i = i2 + 1;
            } else {
                try {
                    break;
                } catch (Exception e3) {
                    SpiderDebug.log(e3);
                }
            }
            SpiderDebug.log(e);
            return "";
        }
        jSONObject.put(C0052.m2261(f55short, 1347, 5, 2537), jSONArray);
        jSONObject.put(str, jSONArray2);
        jSONObject.put(str, jSONArray2);
        return jSONObject.toString();
    }

    @Override // com.github.catvod.spider.Pan
    public void init(Context context, String str) {
        String str2 = C0043.m2020(f55short, 1352, 7, 1315);
        try {
            JSONObject jSONObject = new JSONObject(str);
            super.init(context, str);
            if (jSONObject.has(str2)) {
                this.O = jSONObject.getString(str2);
            } else {
                getSite();
            }
        } catch (Exception e) {
            SpiderDebug.log(e);
        }
    }

    @Override // com.github.catvod.spider.Pan
    public String playerContent(String str, String str2, List<String> list) {
        JSONObject jSONObject = new JSONObject();
        if (!this.O.contains(C0010.m296(f55short, 1359, 4, 2644)) && !this.O.contains(C0021.m1417(f55short, 1363, 5, 1726))) {
            return jSONObject.toString();
        }
        try {
            return super.playerContent(str, str2, list);
        } catch (Exception e) {
            return "";
        }
    }

    public String refTry(String str) {
        if (n) {
            return "";
        }
        getKey();
        n = true;
        return C0068Pe.v(str.startsWith(C0032.m1749(f55short, 1368, 4, 2216)) ? this.O : A7.N(new StringBuilder(), this.O, str), Rc.M(this.s), 3);
    }

    public String searchContent(String str, boolean z) {
        String str2 = C0007.m210(f55short, 1372, 32, 1326);
        try {
            String v = C0068Pe.v(this.O + str2 + URLEncoder.encode(str), Rc.M(this.s), 3);
            if (Rc.ee(v)) {
                v = refTry(str2 + URLEncoder.encode(str));
            }
            Va yq = rN.yq(v);
            JSONArray jSONArray = new JSONArray();
            JSONObject jSONObject = new JSONObject();
            kB cS = yq.cS(C0026.m1551(f55short, 1404, 22, 2360));
            for (int i = 0; i < cS.size(); i++) {
                hN hNVar = cS.get(i);
                hN tF = hNVar.cS(C0001.m35(f55short, 1426, 28, 1497)).tF();
                String Fo = tF.Fo();
                if (Fo.contains(str)) {
                    String Fo2 = hNVar.cS(C0055.m2320(f55short, 1454, 36, 815)).tF().Fo();
                    String pic = getPic(hNVar.cS(C0003.m86(f55short, 1490, 23, 791)).yq(C0000.m18(f55short, 1513, 8, 1413)));
                    Matcher matcher = this.g1.matcher(tF.N(C0030.m1688(f55short, 1521, 4, 3263)));
                    if (matcher.find()) {
                        String group = matcher.group(1);
                        JSONObject jSONObject2 = new JSONObject();
                        jSONObject2.put(C0029.m1635(f55short, 1525, 6, 593), group);
                        jSONObject2.put(C0044.m2052(f55short, 1531, 8, 2188), Fo);
                        jSONObject2.put(C0040.m1953(f55short, 1539, 7, 2972), pic);
                        jSONObject2.put(C0030.m1688(f55short, 1546, 11, 3184), Fo2);
                        jSONArray.put(jSONObject2);
                    }
                }
            }
            jSONObject.put(C0024.m1513(f55short, 1557, 4, 2256), jSONArray);
            return jSONObject.toString();
        } catch (Exception e) {
            e.printStackTrace();
            return "";
        }
    }
}
